STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255fxx_cm33.h
/*******************  Bit definition for DMA_CFCR register  *******************/
#define DMA_CFCR_TCF_Pos       (8U)
#define DMA_CFCR_TCF_Msk       (0x1UL << DMA_CFCR_TCF_Pos)                    /*!< 0x00000100 */
#define DMA_CFCR_TCF           DMA_CFCR_TCF_Msk                              /*!< Transfer complete flag clear */
#define DMA_CFCR_HTF_Pos       (9U)
#define DMA_CFCR_HTF_Msk       (0x1UL << DMA_CFCR_HTF_Pos)                    /*!< 0x00000200 */
#define DMA_CFCR_HTF           DMA_CFCR_HTF_Msk                              /*!< Half transfer complete flag clear */
#define DMA_CFCR_DTEF_Pos      (10U)
#define DMA_CFCR_DTEF_Msk      (0x1UL << DMA_CFCR_DTEF_Pos)                   /*!< 0x00000400 */
#define DMA_CFCR_DTEF          DMA_CFCR_DTEF_Msk                             /*!< Data transfer error flag clear */
#define DMA_CFCR_ULEF_Pos      (11U)
#define DMA_CFCR_ULEF_Msk      (0x1UL << DMA_CFCR_ULEF_Pos)                   /*!< 0x00000800 */
#define DMA_CFCR_ULEF          DMA_CFCR_ULEF_Msk                             /*!< Update linked-list item error flag clear */
#define DMA_CFCR_USEF_Pos      (12U)
#define DMA_CFCR_USEF_Msk      (0x1UL << DMA_CFCR_USEF_Pos)                   /*!< 0x00001000 */
#define DMA_CFCR_USEF          DMA_CFCR_USEF_Msk                             /*!< User setting error flag clear */
#define DMA_CFCR_SUSPF_Pos     (13U)
#define DMA_CFCR_SUSPF_Msk     (0x1UL << DMA_CFCR_SUSPF_Pos)                   /*!< 0x00002000 */
#define DMA_CFCR_SUSPF         DMA_CFCR_SUSPF_Msk                             /*!< Completed suspension flag clear */
#define DMA_CFCR_TOF_Pos       (14U)
#define DMA_CFCR_TOF_Msk       (0x1UL << DMA_CFCR_TOF_Pos)                    /*!< 0x00004000 */
#define DMA_CFCR_TOF           DMA_CFCR_TOF_Msk                              /*!< trigger overrun flag clear */

/*******************  Bit definition for DMA_CSR register  *******************/
#define DMA_CSR_IDLEF_Pos      (0U)
#define DMA_CSR_IDLEF_Msk      (0x1UL << DMA_CSR_IDLEF_Pos)                  /*!< 0x00000001 */
#define DMA_CSR_IDLEF          DMA_CSR_IDLEF_Msk                            /*!< Idle flag */
#define DMA_CSR_TCF_Pos        (8U)
#define DMA_CSR_TCF_Msk        (0x1UL << DMA_CSR_TCF_Pos)                    /*!< 0x00000100 */
#define DMA_CSR_TCF            DMA_CSR_TCF_Msk                              /*!< Transfer complete flag */
#define DMA_CSR_HTF_Pos        (9U)
#define DMA_CSR_HTF_Msk        (0x1UL << DMA_CSR_HTF_Pos)                    /*!< 0x00000200 */
#define DMA_CSR_HTF            DMA_CSR_HTF_Msk                              /*!< Half transfer complete flag */
#define DMA_CSR_DTEF_Pos       (10U)
#define DMA_CSR_DTEF_Msk       (0x1UL << DMA_CSR_DTEF_Pos)                   /*!< 0x00000400 */
#define DMA_CSR_DTEF           DMA_CSR_DTEF_Msk                             /*!< Data transfer error flag */
#define DMA_CSR_ULEF_Pos       (11U)
#define DMA_CSR_ULEF_Msk       (0x1UL << DMA_CSR_ULEF_Pos)                   /*!< 0x00000800 */
#define DMA_CSR_ULEF           DMA_CSR_ULEF_Msk                             /*!< Update linked-list item error flag */
#define DMA_CSR_USEF_Pos       (12U)
#define DMA_CSR_USEF_Msk       (0x1UL << DMA_CSR_USEF_Pos)                   /*!< 0x00001000 */
#define DMA_CSR_USEF           DMA_CSR_USEF_Msk                             /*!< User setting error flag */
#define DMA_CSR_SUSPF_Pos      (13U)
#define DMA_CSR_SUSPF_Msk      (0x1UL << DMA_CSR_SUSPF_Pos)                  /*!< 0x00002000 */
#define DMA_CSR_SUSPF          DMA_CSR_SUSPF_Msk                            /*!< User setting error flag */
#define DMA_CSR_TOF_Pos        (14U)
#define DMA_CSR_TOF_Msk        (0x1UL << DMA_CSR_TOF_Pos)                    /*!< 0x00004000 */
#define DMA_CSR_TOF            DMA_CSR_TOF_Msk                              /*!< trigger overrun flag */
#define DMA_CSR_FIFOL_Pos      (16U)
#define DMA_CSR_FIFOL_Msk      (0xFFUL << DMA_CSR_FIFOL_Pos)                 /*!< 0x00FF0000 */
#define DMA_CSR_FIFOL          DMA_CSR_FIFOL_Msk                            /*!< Monitored FIFO level in bytes */

/*******************  Bit definition for DMA_CCR register  ********************/
#define DMA_CCR_EN_Pos         (0U)
#define DMA_CCR_EN_Msk         (0x1UL << DMA_CCR_EN_Pos)                     /*!< 0x00000001 */
#define DMA_CCR_EN             DMA_CCR_EN_Msk                               /*!< Channel enable */
#define DMA_CCR_RESET_Pos      (1U)
#define DMA_CCR_RESET_Msk      (0x1UL << DMA_CCR_RESET_Pos)                  /*!< 0x00000002 */
#define DMA_CCR_RESET          DMA_CCR_RESET_Msk                            /*!< Channel reset */
#define DMA_CCR_SUSP_Pos       (2U)
#define DMA_CCR_SUSP_Msk       (0x1UL << DMA_CCR_SUSP_Pos)                   /*!< 0x00000004 */
#define DMA_CCR_SUSP           DMA_CCR_SUSP_Msk                             /*!< Channel suspend */
#define DMA_CCR_TCIE_Pos       (8U)
#define DMA_CCR_TCIE_Msk       (0x1UL << DMA_CCR_TCIE_Pos)                   /*!< 0x00000100 */
#define DMA_CCR_TCIE           DMA_CCR_TCIE_Msk                             /*!< Transfer complete interrupt enable */
#define DMA_CCR_HTIE_Pos       (9U)
#define DMA_CCR_HTIE_Msk       (0x1UL << DMA_CCR_HTIE_Pos)                   /*!< 0x00000200 */
#define DMA_CCR_HTIE           DMA_CCR_HTIE_Msk                             /*!< Half transfer complete interrupt enable */
#define DMA_CCR_DTEIE_Pos      (10U)
#define DMA_CCR_DTEIE_Msk      (0x1UL << DMA_CCR_DTEIE_Pos)                  /*!< 0x00000400 */
#define DMA_CCR_DTEIE          DMA_CCR_DTEIE_Msk                            /*!< Data transfer error interrput enable */
#define DMA_CCR_ULEIE_Pos      (11U)
#define DMA_CCR_ULEIE_Msk      (0x1UL << DMA_CCR_ULEIE_Pos)                  /*!< 0x00000800 */
#define DMA_CCR_ULEIE          DMA_CCR_ULEIE_Msk                            /*!< Update linked-list item error interrput enable */
#define DMA_CCR_USEIE_Pos      (12U)
#define DMA_CCR_USEIE_Msk      (0x1UL << DMA_CCR_USEIE_Pos)                  /*!< 0x00001000 */
#define DMA_CCR_USEIE          DMA_CCR_USEIE_Msk                            /*!< User setting error interrput enable */
#define DMA_CCR_SUSPIE_Pos     (13U)
#define DMA_CCR_SUSPIE_Msk     (0x1UL << DMA_CCR_SUSPIE_Pos)                 /*!< 0x00002000 */
#define DMA_CCR_SUSPIE         DMA_CCR_SUSPIE_Msk                           /*!< Completed suspension interrput enable */
#define DMA_CCR_TOIE_Pos       (14U)
#define DMA_CCR_TOIE_Msk       (0x1UL << DMA_CCR_TOIE_Pos)                   /*!< 0x00004000 */
#define DMA_CCR_TOIE           DMA_CCR_TOIE_Msk                             /*!< trigger overrun interrupt enable */
#define DMA_CCR_LSM_Pos        (16U)
#define DMA_CCR_LSM_Msk        (0x1UL << DMA_CCR_LSM_Pos)                    /*!< 0x00010000 */
#define DMA_CCR_LSM            DMA_CCR_LSM_Msk                              /*!< Link step mode */
#define DMA_CCR_LAP_Pos        (17U)
#define DMA_CCR_LAP_Msk        (0x1UL << DMA_CCR_LAP_Pos)                    /*!< 0x00020000 */
#define DMA_CCR_LAP            DMA_CCR_LAP_Msk                              /*!< Linked-list allocated port */
#define DMA_CCR_PRIO_Pos       (22U)
#define DMA_CCR_PRIO_Msk       (0x3UL << DMA_CCR_PRIO_Pos)                   /*!< 0x00C00000 */
#define DMA_CCR_PRIO           DMA_CCR_PRIO_Msk                             /*!< Priority level */
#define DMA_CCR_PRIO_0         (0x1UL << DMA_CCR_PRIO_Pos)                   /*!< 0x00400000 */
#define DMA_CCR_PRIO_1         (0x2UL << DMA_CCR_PRIO_Pos)                   /*!< 0x00800000 */

/*******************  Bit definition for DMA_CTR1 register  *******************/
#define DMA_CTR1_SDW_LOG2_Pos  (0U)
#define DMA_CTR1_SDW_LOG2_Msk  (0x3UL << DMA_CTR1_SDW_LOG2_Pos)             /*!< 0x00000003 */
#define DMA_CTR1_SDW_LOG2      DMA_CTR1_SDW_LOG2_Msk                       /*!< Binary logarithm of the source data width of a burst */
#define DMA_CTR1_SDW_LOG2_0    (0x1UL << DMA_CTR1_SDW_LOG2_Pos)             /*!< Bit 0 */
#define DMA_CTR1_SDW_LOG2_1    (0x2UL << DMA_CTR1_SDW_LOG2_Pos)             /*!< Bit 1 */
#define DMA_CTR1_SINC_Pos      (3U)
#define DMA_CTR1_SINC_Msk      (0x1UL << DMA_CTR1_SINC_Pos)                 /*!< 0x00000008 */
#define DMA_CTR1_SINC          DMA_CTR1_SINC_Msk                           /*!< Source incrementing burst */
#define DMA_CTR1_SBL_1_Pos     (4U)
#define DMA_CTR1_SBL_1_Msk     (0x3FUL << DMA_CTR1_SBL_1_Pos)               /*!< 0x000003F0 */
#define DMA_CTR1_SBL_1         DMA_CTR1_SBL_1_Msk                          /*!< Source burst length minus 1 */
#define DMA_CTR1_PAM_Pos       (11U)
#define DMA_CTR1_PAM_Msk       (0x3UL << DMA_CTR1_PAM_Pos)                  /*!< 0x0001800 */
#define DMA_CTR1_PAM           DMA_CTR1_PAM_Msk                            /*!< Padding / alignment mode */
#define DMA_CTR1_PAM_0         (0x1UL << DMA_CTR1_PAM_Pos)                  /*!< Bit 0 */
#define DMA_CTR1_PAM_1         (0x2UL << DMA_CTR1_PAM_Pos)                  /*!< Bit 1 */
#define DMA_CTR1_SBX_Pos       (13U)
#define DMA_CTR1_SBX_Msk       (0x1UL << DMA_CTR1_SBX_Pos)                  /*!< 0x00002000 */
#define DMA_CTR1_SBX           DMA_CTR1_SBX_Msk                            /*!< Source byte exchange within the unaligned half-word of each source word */
#define DMA_CTR1_SAP_Pos       (14U)
#define DMA_CTR1_SAP_Msk       (0x1UL << DMA_CTR1_SAP_Pos)                  /*!< 0x00004000 */
#define DMA_CTR1_SAP           DMA_CTR1_SAP_Msk                            /*!< Source allocated port */
#define DMA_CTR1_SSEC_Pos      (15U)
#define DMA_CTR1_SSEC_Msk      (0x1UL << DMA_CTR1_SSEC_Pos)                 /*!< 0x00008000 */
#define DMA_CTR1_SSEC          DMA_CTR1_SSEC_Msk                           /*!< Security attribute of the DMA transfer from the source */
#define DMA_CTR1_DDW_LOG2_Pos  (16U)
#define DMA_CTR1_DDW_LOG2_Msk  (0x3UL << DMA_CTR1_DDW_LOG2_Pos)             /*!< 0x00030000 */
#define DMA_CTR1_DDW_LOG2      DMA_CTR1_DDW_LOG2_Msk                       /*!< Binary logarithm of the destination data width of a burst */
#define DMA_CTR1_DDW_LOG2_0    (0x1UL << DMA_CTR1_DDW_LOG2_Pos)             /*!< Bit 0 */
#define DMA_CTR1_DDW_LOG2_1    (0x2UL << DMA_CTR1_DDW_LOG2_Pos)             /*!< Bit 1 */
#define DMA_CTR1_DINC_Pos      (19U)
#define DMA_CTR1_DINC_Msk      (0x1UL << DMA_CTR1_DINC_Pos)                 /*!< 0x00080000 */
#define DMA_CTR1_DINC          DMA_CTR1_DINC_Msk                           /*!< Destination incrementing burst */
#define DMA_CTR1_DBL_1_Pos     (20U)
#define DMA_CTR1_DBL_1_Msk     (0x3FUL << DMA_CTR1_DBL_1_Pos)               /*!< 0x03F00000 */
#define DMA_CTR1_DBL_1         DMA_CTR1_DBL_1_Msk                          /*!< Destination burst length minus 1 */
#define DMA_CTR1_DBX_Pos       (26U)
#define DMA_CTR1_DBX_Msk       (0x1UL << DMA_CTR1_DBX_Pos)                  /*!< 0x04000000 */
#define DMA_CTR1_DBX           DMA_CTR1_DBX_Msk                            /*!< Destination byte exchange */
#define DMA_CTR1_DHX_Pos       (27U)
#define DMA_CTR1_DHX_Msk       (0x1UL << DMA_CTR1_DHX_Pos)                  /*!< 0x08000000 */
#define DMA_CTR1_DHX           DMA_CTR1_DHX_Msk                            /*!< Destination half-word exchange */
#define DMA_CTR1_DWX_Pos       (28U)
#define DMA_CTR1_DWX_Msk       (0x1UL << DMA_CTR1_DWX_Pos)                  /*!< 0x10000000 */
#define DMA_CTR1_DWX           DMA_CTR1_DWX_Msk                            /*!< Destination word exchange */
#define DMA_CTR1_DAP_Pos       (30U)
#define DMA_CTR1_DAP_Msk       (0x1UL << DMA_CTR1_DAP_Pos)                  /*!< 0x40000000 */
#define DMA_CTR1_DAP           DMA_CTR1_DAP_Msk                            /*!< Destination allocated port */
#define DMA_CTR1_DSEC_Pos      (31U)
#define DMA_CTR1_DSEC_Msk      (0x1UL << DMA_CTR1_DSEC_Pos)                 /*!< 0x80000000 */
#define DMA_CTR1_DSEC          DMA_CTR1_DSEC_Msk                           /*!< Security attribute of the DMA transfer from the destination */

