STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255fxx_cm33.h
/******************  Bit definition for DSI_LCCCR register  *******************/
#define DSI_LCCCR_COLC_Pos          (0U)
#define DSI_LCCCR_COLC_Msk          (0xFUL << DSI_LCCCR_COLC_Pos)         /*!< 0x0000000F */
#define DSI_LCCCR_COLC              DSI_LCCCR_COLC_Msk                   /*!< Color coding */
#define DSI_LCCCR_LPE_Pos           (8U)
#define DSI_LCCCR_LPE_Msk           (0x1UL << DSI_LCCCR_LPE_Pos)          /*!< 0x00000100 */
#define DSI_LCCCR_LPE               DSI_LCCCR_LPE_Msk                    /*!< Loosely packed enable */

/******************  Bit definition for DSI_LPMCCR register  ******************/
#define DSI_LPMCCR_VLPSIZE_Pos      (0U)
#define DSI_LPMCCR_VLPSIZE_Msk      (0xFFUL << DSI_LPMCCR_VLPSIZE_Pos)    /*!< 0x000000FF */
#define DSI_LPMCCR_VLPSIZE          DSI_LPMCCR_VLPSIZE_Msk               /*!< VACT largest packet size */
#define DSI_LPMCCR_LPSIZE_Pos       (16U)
#define DSI_LPMCCR_LPSIZE_Msk       (0xFFUL << DSI_LPMCCR_LPSIZE_Pos)     /*!< 0x00FF0000 */
#define DSI_LPMCCR_LPSIZE           DSI_LPMCCR_LPSIZE_Msk                /*!< Largest packet size */

/******************  Bit definition for DSI_VMCCR register  *******************/
#define DSI_VMCCR_VMT_Pos           (0U)
#define DSI_VMCCR_VMT_Msk           (0x3UL << DSI_VMCCR_VMT_Pos)          /*!< 0x00000003 */
#define DSI_VMCCR_VMT               DSI_VMCCR_VMT_Msk                    /*!< Video mode type */
#define DSI_VMCCR_LPVSAE_Pos        (2U)
#define DSI_VMCCR_LPVSAE_Msk        (0x1UL << DSI_VMCCR_LPVSAE_Pos)       /*!< 0x00000004 */
#define DSI_VMCCR_LPVSAE            DSI_VMCCR_LPVSAE_Msk                 /*!< Low-power vertical sync time enable */
#define DSI_VMCCR_LPVBPE_Pos        (3U)
#define DSI_VMCCR_LPVBPE_Msk        (0x1UL << DSI_VMCCR_LPVBPE_Pos)       /*!< 0x00000008 */
#define DSI_VMCCR_LPVBPE            DSI_VMCCR_LPVBPE_Msk                 /*!< Low-power vertical back-porch enable */
#define DSI_VMCCR_LPVFPE_Pos        (4U)
#define DSI_VMCCR_LPVFPE_Msk        (0x1UL << DSI_VMCCR_LPVFPE_Pos)       /*!< 0x00000010 */
#define DSI_VMCCR_LPVFPE            DSI_VMCCR_LPVFPE_Msk                 /*!< Low-power vertical front-porch enable */
#define DSI_VMCCR_LPVAE_Pos         (5U)
#define DSI_VMCCR_LPVAE_Msk         (0x1UL << DSI_VMCCR_LPVAE_Pos)        /*!< 0x00000020 */
#define DSI_VMCCR_LPVAE             DSI_VMCCR_LPVAE_Msk                  /*!< Low-power vertical active enable */
#define DSI_VMCCR_LPHBPE_Pos        (6U)
#define DSI_VMCCR_LPHBPE_Msk        (0x1UL << DSI_VMCCR_LPHBPE_Pos)       /*!< 0x00000040 */
#define DSI_VMCCR_LPHBPE            DSI_VMCCR_LPHBPE_Msk                 /*!< Low-power horizontal back-porch enable */
#define DSI_VMCCR_LPHFE_Pos         (7U)
#define DSI_VMCCR_LPHFE_Msk         (0x1UL << DSI_VMCCR_LPHFE_Pos)        /*!< 0x00000080 */
#define DSI_VMCCR_LPHFE             DSI_VMCCR_LPHFE_Msk                  /*!< Low-power horizontal front-porch enable */
#define DSI_VMCCR_FBTAAE_Pos        (8U)
#define DSI_VMCCR_FBTAAE_Msk        (0x1UL << DSI_VMCCR_FBTAAE_Pos)       /*!< 0x00000100 */
#define DSI_VMCCR_FBTAAE            DSI_VMCCR_FBTAAE_Msk                 /*!< Frame BTA acknowledge enable */
#define DSI_VMCCR_LPCE_Pos          (9U)
#define DSI_VMCCR_LPCE_Msk          (0x1UL << DSI_VMCCR_LPCE_Pos)         /*!< 0x00000200 */
#define DSI_VMCCR_LPCE              DSI_VMCCR_LPCE_Msk                   /*!< Low-power command enable */

/******************  Bit definition for DSI_VPCCR register  *******************/
#define DSI_VPCCR_VPSIZE_Pos        (0U)
#define DSI_VPCCR_VPSIZE_Msk        (0x3FFFUL << DSI_VPCCR_VPSIZE_Pos)    /*!< 0x00003FFF */
#define DSI_VPCCR_VPSIZE            DSI_VPCCR_VPSIZE_Msk                 /*!< Video packet size */

/******************  Bit definition for DSI_VCCCR register  *******************/
#define DSI_VCCCR_NUMC_Pos          (0U)
#define DSI_VCCCR_NUMC_Msk          (0x1FFFUL << DSI_VCCCR_NUMC_Pos)      /*!< 0x00001FFF */
#define DSI_VCCCR_NUMC              DSI_VCCCR_NUMC_Msk                   /*!< Number of chunks */

/******************  Bit definition for DSI_VNPCCR register  ******************/
#define DSI_VNPCCR_NPSIZE_Pos       (0U)
#define DSI_VNPCCR_NPSIZE_Msk       (0x1FFFUL << DSI_VNPCCR_NPSIZE_Pos)   /*!< 0x00001FFF */
#define DSI_VNPCCR_NPSIZE           DSI_VNPCCR_NPSIZE_Msk                /*!< Null packet size */

/*****************  Bit definition for DSI_VHSACCR register  ******************/
#define DSI_VHSACCR_HSA_Pos         (0U)
#define DSI_VHSACCR_HSA_Msk         (0xFFFUL << DSI_VHSACCR_HSA_Pos)      /*!< 0x00000FFF */
#define DSI_VHSACCR_HSA             DSI_VHSACCR_HSA_Msk                  /*!< Horizontal synchronism active duration */

/*****************  Bit definition for DSI_VHBPCCR register  ******************/
#define DSI_VHBPCCR_HBP_Pos         (0U)
#define DSI_VHBPCCR_HBP_Msk         (0xFFFUL << DSI_VHBPCCR_HBP_Pos)      /*!< 0x00000FFF */
#define DSI_VHBPCCR_HBP             DSI_VHBPCCR_HBP_Msk                  /*!< Horizontal back-porch duration */

/******************  Bit definition for DSI_VLCCR register  *******************/
#define DSI_VLCCR_HLINE_Pos         (0U)
#define DSI_VLCCR_HLINE_Msk         (0x7FFFUL << DSI_VLCCR_HLINE_Pos)     /*!< 0x00007FFF */
#define DSI_VLCCR_HLINE             DSI_VLCCR_HLINE_Msk                  /*!< Horizontal line duration */

/*****************  Bit definition for DSI_VVSACCR register  ******************/
#define DSI_VVSACCR_VSA_Pos         (0U)
#define DSI_VVSACCR_VSA_Msk         (0x3FFUL << DSI_VVSACCR_VSA_Pos)      /*!< 0x000003FF */
#define DSI_VVSACCR_VSA             DSI_VVSACCR_VSA_Msk                  /*!< Vertical synchronism active duration */

/*****************  Bit definition for DSI_VVBPCCR register  ******************/
#define DSI_VVBPCCR_VBP_Pos         (0U)
#define DSI_VVBPCCR_VBP_Msk         (0x3FFUL << DSI_VVBPCCR_VBP_Pos)      /*!< 0x000003FF */
#define DSI_VVBPCCR_VBP             DSI_VVBPCCR_VBP_Msk                  /*!< Vertical back-porch duration */

/*****************  Bit definition for DSI_VVFPCCR register  ******************/
#define DSI_VVFPCCR_VFP_Pos         (0U)
#define DSI_VVFPCCR_VFP_Msk         (0x3FFUL << DSI_VVFPCCR_VFP_Pos)      /*!< 0x000003FF */
#define DSI_VVFPCCR_VFP             DSI_VVFPCCR_VFP_Msk                  /*!< Vertical front-porch duration */

/******************  Bit definition for DSI_VVACCR register  ******************/
#define DSI_VVACCR_VA_Pos           (0U)
#define DSI_VVACCR_VA_Msk           (0x3FFFUL << DSI_VVACCR_VA_Pos)       /*!< 0x00003FFF */
#define DSI_VVACCR_VA               DSI_VVACCR_VA_Msk                    /*!< Vertical active duration */

/******************  Bit definition for DSI_TDCCR register  *******************/
#define DSI_TDCCR_M3D_Pos           (0U)
#define DSI_TDCCR_M3D_Msk           (0x3UL << DSI_TDCCR_M3D_Pos)          /*!< 0x00000003 */
#define DSI_TDCCR_M3D               DSI_TDCCR_M3D_Msk                    /*!< 3D mode */
#define DSI_TDCCR_F3D_Pos           (2U)
#define DSI_TDCCR_F3D_Msk           (0x3UL << DSI_TDCCR_F3D_Pos)          /*!< 0x0000000C */
#define DSI_TDCCR_F3D               DSI_TDCCR_F3D_Msk                    /*!< 3D format */
#define DSI_TDCCR_SVS_Pos           (4U)
#define DSI_TDCCR_SVS_Msk           (0x1UL << DSI_TDCCR_SVS_Pos)          /*!< 0x00000010 */
#define DSI_TDCCR_SVS               DSI_TDCCR_SVS_Msk                    /*!< Second VSYNC */
#define DSI_TDCCR_RF_Pos            (5U)
#define DSI_TDCCR_RF_Msk            (0x1UL << DSI_TDCCR_RF_Pos)           /*!< 0x00000020 */
#define DSI_TDCCR_RF                DSI_TDCCR_RF_Msk                     /*!< Right first */
#define DSI_TDCCR_S3DC_Pos          (16U)
#define DSI_TDCCR_S3DC_Msk          (0x1UL << DSI_TDCCR_S3DC_Pos)         /*!< 0x00010000 */
#define DSI_TDCCR_S3DC              DSI_TDCCR_S3DC_Msk                   /*!< Send 3D control */

/******************  Bit definition for DSI_WCFGR register  *******************/
#define DSI_WCFGR_DSIM_Pos          (0U)
#define DSI_WCFGR_DSIM_Msk          (0x1UL << DSI_WCFGR_DSIM_Pos)         /*!< 0x00000001 */
#define DSI_WCFGR_DSIM              DSI_WCFGR_DSIM_Msk                   /*!< DSI mode */
#define DSI_WCFGR_COLMUX_Pos        (1U)
#define DSI_WCFGR_COLMUX_Msk        (0x7UL << DSI_WCFGR_COLMUX_Pos)       /*!< 0x0000000E */
#define DSI_WCFGR_COLMUX            DSI_WCFGR_COLMUX_Msk                 /*!< Color multiplexing */
#define DSI_WCFGR_TESRC_Pos         (4U)
#define DSI_WCFGR_TESRC_Msk         (0x1UL << DSI_WCFGR_TESRC_Pos)        /*!< 0x00000010 */
#define DSI_WCFGR_TESRC             DSI_WCFGR_TESRC_Msk                  /*!< TE source */
#define DSI_WCFGR_TEPOL_Pos         (5U)
#define DSI_WCFGR_TEPOL_Msk         (0x1UL << DSI_WCFGR_TEPOL_Pos)        /*!< 0x00000020 */
#define DSI_WCFGR_TEPOL             DSI_WCFGR_TEPOL_Msk                  /*!< TE polarity */
#define DSI_WCFGR_AR_Pos            (6U)
#define DSI_WCFGR_AR_Msk            (0x1UL << DSI_WCFGR_AR_Pos)           /*!< 0x00000040 */
#define DSI_WCFGR_AR                DSI_WCFGR_AR_Msk                     /*!< Automatic refresh */
#define DSI_WCFGR_VSPOL_Pos         (7U)
#define DSI_WCFGR_VSPOL_Msk         (0x1UL << DSI_WCFGR_VSPOL_Pos)        /*!< 0x00000080 */
#define DSI_WCFGR_VSPOL             DSI_WCFGR_VSPOL_Msk                  /*!< VSync polarity */

