STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255fxx_cm33.h
/******************  Bit definition for EXTI2_PRIVCFGR1 register  ******************/
#define EXTI2_PRIVCFGR1_PRIV0_Pos  (0U)
#define EXTI2_PRIVCFGR1_PRIV0_Msk  (0x1UL << EXTI2_PRIVCFGR1_PRIV0_Pos)          /*!< 0x00000001 */
#define EXTI2_PRIVCFGR1_PRIV0      EXTI2_PRIVCFGR1_PRIV0_Msk                    /*!< SEC/PRIV enable on event input 0 */
#define EXTI2_PRIVCFGR1_PRIV1_Pos  (1U)
#define EXTI2_PRIVCFGR1_PRIV1_Msk  (0x1UL << EXTI2_PRIVCFGR1_PRIV1_Pos)          /*!< 0x00000002 */
#define EXTI2_PRIVCFGR1_PRIV1      EXTI2_PRIVCFGR1_PRIV1_Msk                    /*!< SEC/PRIV enable on event input 1 */
#define EXTI2_PRIVCFGR1_PRIV2_Pos  (2U)
#define EXTI2_PRIVCFGR1_PRIV2_Msk  (0x1UL << EXTI2_PRIVCFGR1_PRIV2_Pos)          /*!< 0x00000004 */
#define EXTI2_PRIVCFGR1_PRIV2      EXTI2_PRIVCFGR1_PRIV2_Msk                    /*!< SEC/PRIV enable on event input 2 */
#define EXTI2_PRIVCFGR1_PRIV3_Pos  (3U)
#define EXTI2_PRIVCFGR1_PRIV3_Msk  (0x1UL << EXTI2_PRIVCFGR1_PRIV3_Pos)          /*!< 0x00000008 */
#define EXTI2_PRIVCFGR1_PRIV3      EXTI2_PRIVCFGR1_PRIV3_Msk                    /*!< SEC/PRIV enable on event input 3 */
#define EXTI2_PRIVCFGR1_PRIV4_Pos  (4U)
#define EXTI2_PRIVCFGR1_PRIV4_Msk  (0x1UL << EXTI2_PRIVCFGR1_PRIV4_Pos)          /*!< 0x00000010 */
#define EXTI2_PRIVCFGR1_PRIV4      EXTI2_PRIVCFGR1_PRIV4_Msk                    /*!< SEC/PRIV enable on event input 4 */
#define EXTI2_PRIVCFGR1_PRIV5_Pos  (5U)
#define EXTI2_PRIVCFGR1_PRIV5_Msk  (0x1UL << EXTI2_PRIVCFGR1_PRIV5_Pos)          /*!< 0x00000020 */
#define EXTI2_PRIVCFGR1_PRIV5      EXTI2_PRIVCFGR1_PRIV5_Msk                    /*!< SEC/PRIV enable on event input 5 */
#define EXTI2_PRIVCFGR1_PRIV6_Pos  (6U)
#define EXTI2_PRIVCFGR1_PRIV6_Msk  (0x1UL << EXTI2_PRIVCFGR1_PRIV6_Pos)          /*!< 0x00000040 */
#define EXTI2_PRIVCFGR1_PRIV6      EXTI2_PRIVCFGR1_PRIV6_Msk                    /*!< SEC/PRIV enable on event input 6 */
#define EXTI2_PRIVCFGR1_PRIV7_Pos  (7U)
#define EXTI2_PRIVCFGR1_PRIV7_Msk  (0x1UL << EXTI2_PRIVCFGR1_PRIV7_Pos)          /*!< 0x00000080 */
#define EXTI2_PRIVCFGR1_PRIV7      EXTI2_PRIVCFGR1_PRIV7_Msk                    /*!< SEC/PRIV enable on event input 7 */
#define EXTI2_PRIVCFGR1_PRIV8_Pos  (8U)
#define EXTI2_PRIVCFGR1_PRIV8_Msk  (0x1UL << EXTI2_PRIVCFGR1_PRIV8_Pos)          /*!< 0x00000100 */
#define EXTI2_PRIVCFGR1_PRIV8      EXTI2_PRIVCFGR1_PRIV8_Msk                    /*!< SEC/PRIV enable on event input 8 */
#define EXTI2_PRIVCFGR1_PRIV9_Pos  (9U)
#define EXTI2_PRIVCFGR1_PRIV9_Msk  (0x1UL << EXTI2_PRIVCFGR1_PRIV9_Pos)          /*!< 0x00000200 */
#define EXTI2_PRIVCFGR1_PRIV9      EXTI2_PRIVCFGR1_PRIV9_Msk                    /*!< SEC/PRIV enable on event input 9 */
#define EXTI2_PRIVCFGR1_PRIV10_Pos (10U)
#define EXTI2_PRIVCFGR1_PRIV10_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV10_Pos)         /*!< 0x00000400 */
#define EXTI2_PRIVCFGR1_PRIV10     EXTI2_PRIVCFGR1_PRIV10_Msk                   /*!< SEC/PRIV enable on event input 10 */
#define EXTI2_PRIVCFGR1_PRIV11_Pos (11U)
#define EXTI2_PRIVCFGR1_PRIV11_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV11_Pos)         /*!< 0x00000800 */
#define EXTI2_PRIVCFGR1_PRIV11     EXTI2_PRIVCFGR1_PRIV11_Msk                   /*!< SEC/PRIV enable on event input 11 */
#define EXTI2_PRIVCFGR1_PRIV12_Pos (12U)
#define EXTI2_PRIVCFGR1_PRIV12_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV12_Pos)         /*!< 0x00001000 */
#define EXTI2_PRIVCFGR1_PRIV12     EXTI2_PRIVCFGR1_PRIV12_Msk                   /*!< SEC/PRIV enable on event input 12 */
#define EXTI2_PRIVCFGR1_PRIV13_Pos (13U)
#define EXTI2_PRIVCFGR1_PRIV13_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV13_Pos)         /*!< 0x00002000 */
#define EXTI2_PRIVCFGR1_PRIV13     EXTI2_PRIVCFGR1_PRIV13_Msk                   /*!< SEC/PRIV enable on event input 13 */
#define EXTI2_PRIVCFGR1_PRIV14_Pos (14U)
#define EXTI2_PRIVCFGR1_PRIV14_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV14_Pos)         /*!< 0x00004000 */
#define EXTI2_PRIVCFGR1_PRIV14     EXTI2_PRIVCFGR1_PRIV14_Msk                   /*!< SEC/PRIV enable on event input 14 */
#define EXTI2_PRIVCFGR1_PRIV15_Pos (15U)
#define EXTI2_PRIVCFGR1_PRIV15_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV15_Pos)         /*!< 0x00008000 */
#define EXTI2_PRIVCFGR1_PRIV15     EXTI2_PRIVCFGR1_PRIV15_Msk                   /*!< SEC/PRIV enable on event input 15 */
#define EXTI2_PRIVCFGR1_PRIV16_Pos (16U)
#define EXTI2_PRIVCFGR1_PRIV16_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV16_Pos)         /*!< 0x00010000 */
#define EXTI2_PRIVCFGR1_PRIV16     EXTI2_PRIVCFGR1_PRIV16_Msk                   /*!< SEC/PRIV enable on event input 16 */
#define EXTI2_PRIVCFGR1_PRIV17_Pos (17U)
#define EXTI2_PRIVCFGR1_PRIV17_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV17_Pos)         /*!< 0x00020000 */
#define EXTI2_PRIVCFGR1_PRIV17     EXTI2_PRIVCFGR1_PRIV17_Msk                   /*!< SEC/PRIV enable on event input 17 */
#define EXTI2_PRIVCFGR1_PRIV18_Pos (18U)
#define EXTI2_PRIVCFGR1_PRIV18_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV18_Pos)         /*!< 0x00040000 */
#define EXTI2_PRIVCFGR1_PRIV18     EXTI2_PRIVCFGR1_PRIV18_Msk                   /*!< SEC/PRIV enable on event input 18 */
#define EXTI2_PRIVCFGR1_PRIV19_Pos (19U)
#define EXTI2_PRIVCFGR1_PRIV19_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV19_Pos)         /*!< 0x00080000 */
#define EXTI2_PRIVCFGR1_PRIV19     EXTI2_PRIVCFGR1_PRIV19_Msk                   /*!< SEC/PRIV enable on event input 19 */
#define EXTI2_PRIVCFGR1_PRIV20_Pos (20U)
#define EXTI2_PRIVCFGR1_PRIV20_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV20_Pos)         /*!< 0x00100000 */
#define EXTI2_PRIVCFGR1_PRIV20     EXTI2_PRIVCFGR1_PRIV20_Msk                   /*!< SEC/PRIV enable on event input 20 */
#define EXTI2_PRIVCFGR1_PRIV21_Pos (21U)
#define EXTI2_PRIVCFGR1_PRIV21_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV21_Pos)         /*!< 0x00200000 */
#define EXTI2_PRIVCFGR1_PRIV21     EXTI2_PRIVCFGR1_PRIV21_Msk                   /*!< SEC/PRIV enable on event input 21 */
#define EXTI2_PRIVCFGR1_PRIV22_Pos (22U)
#define EXTI2_PRIVCFGR1_PRIV22_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV22_Pos)         /*!< 0x00400000 */
#define EXTI2_PRIVCFGR1_PRIV22     EXTI2_PRIVCFGR1_PRIV22_Msk                   /*!< SEC/PRIV enable on event input 22 */
#define EXTI2_PRIVCFGR1_PRIV23_Pos (23U)
#define EXTI2_PRIVCFGR1_PRIV23_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV23_Pos)         /*!< 0x00800000 */
#define EXTI2_PRIVCFGR1_PRIV23     EXTI2_PRIVCFGR1_PRIV23_Msk                   /*!< SEC/PRIV enable on event input 23 */
#define EXTI2_PRIVCFGR1_PRIV24_Pos (24U)
#define EXTI2_PRIVCFGR1_PRIV24_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV24_Pos)         /*!< 0x01000000 */
#define EXTI2_PRIVCFGR1_PRIV24     EXTI2_PRIVCFGR1_PRIV24_Msk                   /*!< SEC/PRIV enable on event input 24 */
#define EXTI2_PRIVCFGR1_PRIV25_Pos (25U)
#define EXTI2_PRIVCFGR1_PRIV25_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV25_Pos)         /*!< 0x02000000 */
#define EXTI2_PRIVCFGR1_PRIV25     EXTI2_PRIVCFGR1_PRIV25_Msk                   /*!< SEC/PRIV enable on event input 25 */
#define EXTI2_PRIVCFGR1_PRIV26_Pos (26U)
#define EXTI2_PRIVCFGR1_PRIV26_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV26_Pos)         /*!< 0x04000000 */
#define EXTI2_PRIVCFGR1_PRIV26     EXTI2_PRIVCFGR1_PRIV26_Msk                   /*!< SEC/PRIV enable on event input 26 */
#define EXTI2_PRIVCFGR1_PRIV27_Pos (27U)
#define EXTI2_PRIVCFGR1_PRIV27_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV27_Pos)         /*!< 0x08000000 */
#define EXTI2_PRIVCFGR1_PRIV27     EXTI2_PRIVCFGR1_PRIV27_Msk                   /*!< SEC/PRIV enable on event input 27 */
/* no event input 28  */
#define EXTI2_PRIVCFGR1_PRIV29_Pos (29U)
#define EXTI2_PRIVCFGR1_PRIV29_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV29_Pos)         /*!< 0x20000000 */
#define EXTI2_PRIVCFGR1_PRIV29     EXTI2_PRIVCFGR1_PRIV29_Msk                   /*!< SEC/PRIV enable on event input 29 */
#define EXTI2_PRIVCFGR1_PRIV30_Pos (30U)
#define EXTI2_PRIVCFGR1_PRIV30_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV30_Pos)         /*!< 0x40000000 */
#define EXTI2_PRIVCFGR1_PRIV30     EXTI2_PRIVCFGR1_PRIV30_Msk                   /*!< SEC/PRIV enable on event input 30 */
#define EXTI2_PRIVCFGR1_PRIV31_Pos (31U)
#define EXTI2_PRIVCFGR1_PRIV31_Msk (0x1UL << EXTI2_PRIVCFGR1_PRIV31_Pos)         /*!< 0x80000000 */
#define EXTI2_PRIVCFGR1_PRIV31     EXTI2_PRIVCFGR1_PRIV31_Msk                   /*!< SEC/PRIV enable on event input 31 */

/******************  Bit definition for EXTI2_RTSR2 register  *******************/
#define EXTI2_RTSR2_RT46_Pos        (14U)
#define EXTI2_RTSR2_RT46_Msk        (0x1UL << EXTI2_RTSR2_RT46_Pos)               /*!< 0x00004000 */
#define EXTI2_RTSR2_RT46            EXTI2_RTSR2_RT46_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RTSR2_RT47_Pos        (15U)
#define EXTI2_RTSR2_RT47_Msk        (0x1UL << EXTI2_RTSR2_RT47_Pos)               /*!< 0x00008000 */
#define EXTI2_RTSR2_RT47            EXTI2_RTSR2_RT47_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RTSR2_RT48_Pos        (16U)
#define EXTI2_RTSR2_RT48_Msk        (0x1UL << EXTI2_RTSR2_RT48_Pos)               /*!< 0x00010000 */
#define EXTI2_RTSR2_RT48            EXTI2_RTSR2_RT48_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RTSR2_RT49_Pos        (17U)
#define EXTI2_RTSR2_RT49_Msk        (0x1UL << EXTI2_RTSR2_RT49_Pos)               /*!< 0x00020000 */
#define EXTI2_RTSR2_RT49            EXTI2_RTSR2_RT49_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RTSR2_RT50_Pos        (18U)
#define EXTI2_RTSR2_RT50_Msk        (0x1UL << EXTI2_RTSR2_RT50_Pos)               /*!< 0x00040000 */
#define EXTI2_RTSR2_RT50            EXTI2_RTSR2_RT50_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RTSR2_RT51_Pos        (19U)
#define EXTI2_RTSR2_RT51_Msk        (0x1UL << EXTI2_RTSR2_RT51_Pos)               /*!< 0x00080000 */
#define EXTI2_RTSR2_RT51            EXTI2_RTSR2_RT51_Msk                         /*!< Rising trigger event configuration bit of line 51 */
#define EXTI2_RTSR2_RT59_Pos        (27U)
#define EXTI2_RTSR2_RT59_Msk        (0x1UL << EXTI2_RTSR2_RT59_Pos)               /*!< 0x08000000 */
#define EXTI2_RTSR2_RT59            EXTI2_RTSR2_RT59_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RTSR2_RT60_Pos        (28U)
#define EXTI2_RTSR2_RT60_Msk        (0x1UL << EXTI2_RTSR2_RT60_Pos)               /*!< 0x10000000 */
#define EXTI2_RTSR2_RT60            EXTI2_RTSR2_RT60_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_RTSR2_RT61_Pos        (29U)
#define EXTI2_RTSR2_RT61_Msk        (0x1UL << EXTI2_RTSR2_RT61_Pos)               /*!< 0x20000000 */
#define EXTI2_RTSR2_RT61            EXTI2_RTSR2_RT61_Msk                         /*!< Rising trigger event configuration bit of line 49 */

/******************  Bit definition for EXTI2_FTSR2 register  *******************/
#define EXTI2_FTSR2_FT46_Pos        (14U)
#define EXTI2_FTSR2_FT46_Msk        (0x1UL << EXTI2_FTSR2_FT46_Pos)               /*!< 0x00004000 */
#define EXTI2_FTSR2_FT46            EXTI2_FTSR2_FT46_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FTSR2_FT47_Pos        (15U)
#define EXTI2_FTSR2_FT47_Msk        (0x1UL << EXTI2_FTSR2_FT47_Pos)               /*!< 0x00008000 */
#define EXTI2_FTSR2_FT47            EXTI2_FTSR2_FT47_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FTSR2_FT48_Pos        (16U)
#define EXTI2_FTSR2_FT48_Msk        (0x1UL << EXTI2_FTSR2_FT48_Pos)               /*!< 0x00010000 */
#define EXTI2_FTSR2_FT48            EXTI2_FTSR2_FT48_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FTSR2_FT49_Pos        (17U)
#define EXTI2_FTSR2_FT49_Msk        (0x1UL << EXTI2_FTSR2_FT49_Pos)               /*!< 0x00020000 */
#define EXTI2_FTSR2_FT49            EXTI2_FTSR2_FT49_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FTSR2_FT50_Pos        (18U)
#define EXTI2_FTSR2_FT50_Msk        (0x1UL << EXTI2_FTSR2_FT50_Pos)               /*!< 0x00040000 */
#define EXTI2_FTSR2_FT50            EXTI2_FTSR2_FT50_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FTSR2_FT51_Pos        (19U)
#define EXTI2_FTSR2_FT51_Msk        (0x1UL << EXTI2_FTSR2_FT51_Pos)               /*!< 0x00080000 */
#define EXTI2_FTSR2_FT51            EXTI2_FTSR2_FT51_Msk                         /*!< Rising trigger event configuration bit of line 51 */
#define EXTI2_FTSR2_FT59_Pos        (27U)
#define EXTI2_FTSR2_FT59_Msk        (0x1UL << EXTI2_FTSR2_FT59_Pos)               /*!< 0x08000000 */
#define EXTI2_FTSR2_FT59            EXTI2_FTSR2_FT59_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FTSR2_FT60_Pos        (28U)
#define EXTI2_FTSR2_FT60_Msk        (0x1UL << EXTI2_FTSR2_FT60_Pos)               /*!< 0x10000000 */
#define EXTI2_FTSR2_FT60            EXTI2_FTSR2_FT60_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI2_FTSR2_FT61_Pos        (29U)
#define EXTI2_FTSR2_FT61_Msk        (0x1UL << EXTI2_FTSR2_FT61_Pos)               /*!< 0x20000000 */
#define EXTI2_FTSR2_FT61            EXTI2_FTSR2_FT61_Msk                         /*!< Rising trigger event configuration bit of line 49 */

