STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255fxx_cm33.h
/*****************  Bit definition for LVDS_DMLCR1 register  ******************/
#define LVDS_DMLCR1_MAP0_Pos                                   (0U)
#define LVDS_DMLCR1_MAP0_Msk                                   (0x1FUL << LVDS_DMLCR1_MAP0_Pos)                                  /*!< 0x0000001F */
#define LVDS_DMLCR1_MAP0                                       LVDS_DMLCR1_MAP0_Msk                                             /*!< Mapping for bit 0 of that DataLane. */
#define LVDS_DMLCR1_MAP0_0                                     (0x1UL << LVDS_DMLCR1_MAP0_Pos)                                   /*!< 0x00000001 */
#define LVDS_DMLCR1_MAP0_1                                     (0x2UL << LVDS_DMLCR1_MAP0_Pos)                                   /*!< 0x00000002 */
#define LVDS_DMLCR1_MAP0_2                                     (0x4UL << LVDS_DMLCR1_MAP0_Pos)                                   /*!< 0x00000004 */
#define LVDS_DMLCR1_MAP0_3                                     (0x8UL << LVDS_DMLCR1_MAP0_Pos)                                   /*!< 0x00000008 */
#define LVDS_DMLCR1_MAP0_4                                     (0x10UL << LVDS_DMLCR1_MAP0_Pos)                                  /*!< 0x00000010 */
#define LVDS_DMLCR1_MAP1_Pos                                   (5U)
#define LVDS_DMLCR1_MAP1_Msk                                   (0x1FUL << LVDS_DMLCR1_MAP1_Pos)                                  /*!< 0x000003E0 */
#define LVDS_DMLCR1_MAP1                                       LVDS_DMLCR1_MAP1_Msk                                             /*!< Mapping for bit 1 of that DataLane. */
#define LVDS_DMLCR1_MAP1_0                                     (0x1UL << LVDS_DMLCR1_MAP1_Pos)                                  /*!< 0x00000020 */
#define LVDS_DMLCR1_MAP1_1                                     (0x2UL << LVDS_DMLCR1_MAP1_Pos)                                  /*!< 0x00000040 */
#define LVDS_DMLCR1_MAP1_2                                     (0x4UL << LVDS_DMLCR1_MAP1_Pos)                                  /*!< 0x00000080 */
#define LVDS_DMLCR1_MAP1_3                                     (0x8UL << LVDS_DMLCR1_MAP1_Pos)                                 /*!< 0x00000100 */
#define LVDS_DMLCR1_MAP1_4                                     (0x10UL << LVDS_DMLCR1_MAP1_Pos)                                 /*!< 0x00000200 */
#define LVDS_DMLCR1_MAP2_Pos                                   (10U)
#define LVDS_DMLCR1_MAP2_Msk                                   (0x1FUL << LVDS_DMLCR1_MAP2_Pos)                                  /*!< 0x00007C00 */
#define LVDS_DMLCR1_MAP2                                       LVDS_DMLCR1_MAP2_Msk                                             /*!< Mapping for bit 2 of that DataLane. */
#define LVDS_DMLCR1_MAP2_0                                     (0x1UL << LVDS_DMLCR1_MAP2_Pos)                                 /*!< 0x00000400 */
#define LVDS_DMLCR1_MAP2_1                                     (0x2UL << LVDS_DMLCR1_MAP2_Pos)                                 /*!< 0x00000800 */
#define LVDS_DMLCR1_MAP2_2                                     (0x4UL << LVDS_DMLCR1_MAP2_Pos)                                /*!< 0x00001000 */
#define LVDS_DMLCR1_MAP2_3                                     (0x8UL << LVDS_DMLCR1_MAP2_Pos)                                /*!< 0x00002000 */
#define LVDS_DMLCR1_MAP2_4                                     (0x10UL << LVDS_DMLCR1_MAP2_Pos)                                /*!< 0x00004000 */
#define LVDS_DMLCR1_MAP3_Pos                                   (15U)
#define LVDS_DMLCR1_MAP3_Msk                                   (0x1FUL << LVDS_DMLCR1_MAP3_Pos)                                  /*!< 0x000F8000 */
#define LVDS_DMLCR1_MAP3                                       LVDS_DMLCR1_MAP3_Msk                                             /*!< Mapping for bit 3 of that DataLane. */
#define LVDS_DMLCR1_MAP3_0                                     (0x1UL << LVDS_DMLCR1_MAP3_Pos)                                /*!< 0x00008000 */
#define LVDS_DMLCR1_MAP3_1                                     (0x2UL << LVDS_DMLCR1_MAP3_Pos)                               /*!< 0x00010000 */
#define LVDS_DMLCR1_MAP3_2                                     (0x4UL << LVDS_DMLCR1_MAP3_Pos)                               /*!< 0x00020000 */
#define LVDS_DMLCR1_MAP3_3                                     (0x8UL << LVDS_DMLCR1_MAP3_Pos)                               /*!< 0x00040000 */
#define LVDS_DMLCR1_MAP3_4                                     (0x10UL << LVDS_DMLCR1_MAP3_Pos)                               /*!< 0x00080000 */

/*****************  Bit definition for LVDS_DMMCR1 register  ******************/
#define LVDS_DMMCR1_MAP4_Pos                                   (0U)
#define LVDS_DMMCR1_MAP4_Msk                                   (0x1FUL << LVDS_DMMCR1_MAP4_Pos)                                  /*!< 0x0000001F */
#define LVDS_DMMCR1_MAP4                                       LVDS_DMMCR1_MAP4_Msk                                             /*!< Mapping for bit 4 of that DataLane. */
#define LVDS_DMMCR1_MAP4_0                                     (0x1UL << LVDS_DMMCR1_MAP4_Pos)                                   /*!< 0x00000001 */
#define LVDS_DMMCR1_MAP4_1                                     (0x2UL << LVDS_DMMCR1_MAP4_Pos)                                   /*!< 0x00000002 */
#define LVDS_DMMCR1_MAP4_2                                     (0x4UL << LVDS_DMMCR1_MAP4_Pos)                                   /*!< 0x00000004 */
#define LVDS_DMMCR1_MAP4_3                                     (0x8UL << LVDS_DMMCR1_MAP4_Pos)                                   /*!< 0x00000008 */
#define LVDS_DMMCR1_MAP4_4                                     (0x10UL << LVDS_DMMCR1_MAP4_Pos)                                  /*!< 0x00000010 */
#define LVDS_DMMCR1_MAP5_Pos                                   (5U)
#define LVDS_DMMCR1_MAP5_Msk                                   (0x1FUL << LVDS_DMMCR1_MAP5_Pos)                                  /*!< 0x000003E0 */
#define LVDS_DMMCR1_MAP5                                       LVDS_DMMCR1_MAP5_Msk                                             /*!< Mapping for bit 5 of that DataLane. */
#define LVDS_DMMCR1_MAP5_0                                     (0x1UL << LVDS_DMMCR1_MAP5_Pos)                                  /*!< 0x00000020 */
#define LVDS_DMMCR1_MAP5_1                                     (0x2UL << LVDS_DMMCR1_MAP5_Pos)                                  /*!< 0x00000040 */
#define LVDS_DMMCR1_MAP5_2                                     (0x4UL << LVDS_DMMCR1_MAP5_Pos)                                  /*!< 0x00000080 */
#define LVDS_DMMCR1_MAP5_3                                     (0x8UL << LVDS_DMMCR1_MAP5_Pos)                                 /*!< 0x00000100 */
#define LVDS_DMMCR1_MAP5_4                                     (0x10UL << LVDS_DMMCR1_MAP5_Pos)                                 /*!< 0x00000200 */
#define LVDS_DMMCR1_MAP6_Pos                                   (10U)
#define LVDS_DMMCR1_MAP6_Msk                                   (0x1FUL << LVDS_DMMCR1_MAP6_Pos)                                  /*!< 0x00007C00 */
#define LVDS_DMMCR1_MAP6                                       LVDS_DMMCR1_MAP6_Msk                                             /*!< Mapping for bit 6 of that DataLane. */
#define LVDS_DMMCR1_MAP6_0                                     (0x1UL << LVDS_DMMCR1_MAP6_Pos)                                 /*!< 0x00000400 */
#define LVDS_DMMCR1_MAP6_1                                     (0x2UL << LVDS_DMMCR1_MAP6_Pos)                                 /*!< 0x00000800 */
#define LVDS_DMMCR1_MAP6_2                                     (0x4UL << LVDS_DMMCR1_MAP6_Pos)                                /*!< 0x00001000 */
#define LVDS_DMMCR1_MAP6_3                                     (0x8UL << LVDS_DMMCR1_MAP6_Pos)                                /*!< 0x00002000 */
#define LVDS_DMMCR1_MAP6_4                                     (0x10UL << LVDS_DMMCR1_MAP6_Pos)                                /*!< 0x00004000 */

/*****************  Bit definition for LVDS_DMLCR2 register  ******************/
#define LVDS_DMLCR2_MAP0_Pos                                   (0U)
#define LVDS_DMLCR2_MAP0_Msk                                   (0x1FUL << LVDS_DMLCR2_MAP0_Pos)                                  /*!< 0x0000001F */
#define LVDS_DMLCR2_MAP0                                       LVDS_DMLCR2_MAP0_Msk                                             /*!< Mapping for bit 0 of that DataLane. */
#define LVDS_DMLCR2_MAP0_0                                     (0x1UL << LVDS_DMLCR2_MAP0_Pos)                                   /*!< 0x00000001 */
#define LVDS_DMLCR2_MAP0_1                                     (0x2UL << LVDS_DMLCR2_MAP0_Pos)                                   /*!< 0x00000002 */
#define LVDS_DMLCR2_MAP0_2                                     (0x4UL << LVDS_DMLCR2_MAP0_Pos)                                   /*!< 0x00000004 */
#define LVDS_DMLCR2_MAP0_3                                     (0x8UL << LVDS_DMLCR2_MAP0_Pos)                                   /*!< 0x00000008 */
#define LVDS_DMLCR2_MAP0_4                                     (0x10UL << LVDS_DMLCR2_MAP0_Pos)                                  /*!< 0x00000010 */
#define LVDS_DMLCR2_MAP1_Pos                                   (5U)
#define LVDS_DMLCR2_MAP1_Msk                                   (0x1FUL << LVDS_DMLCR2_MAP1_Pos)                                  /*!< 0x000003E0 */
#define LVDS_DMLCR2_MAP1                                       LVDS_DMLCR2_MAP1_Msk                                             /*!< Mapping for bit 1 of that DataLane. */
#define LVDS_DMLCR2_MAP1_0                                     (0x1UL << LVDS_DMLCR2_MAP1_Pos)                                  /*!< 0x00000020 */
#define LVDS_DMLCR2_MAP1_1                                     (0x2UL << LVDS_DMLCR2_MAP1_Pos)                                  /*!< 0x00000040 */
#define LVDS_DMLCR2_MAP1_2                                     (0x4UL << LVDS_DMLCR2_MAP1_Pos)                                  /*!< 0x00000080 */
#define LVDS_DMLCR2_MAP1_3                                     (0x8UL << LVDS_DMLCR2_MAP1_Pos)                                 /*!< 0x00000100 */
#define LVDS_DMLCR2_MAP1_4                                     (0x10UL << LVDS_DMLCR2_MAP1_Pos)                                 /*!< 0x00000200 */
#define LVDS_DMLCR2_MAP2_Pos                                   (10U)
#define LVDS_DMLCR2_MAP2_Msk                                   (0x1FUL << LVDS_DMLCR2_MAP2_Pos)                                  /*!< 0x00007C00 */
#define LVDS_DMLCR2_MAP2                                       LVDS_DMLCR2_MAP2_Msk                                             /*!< Mapping for bit 2 of that DataLane. */
#define LVDS_DMLCR2_MAP2_0                                     (0x1UL << LVDS_DMLCR2_MAP2_Pos)                                 /*!< 0x00000400 */
#define LVDS_DMLCR2_MAP2_1                                     (0x2UL << LVDS_DMLCR2_MAP2_Pos)                                 /*!< 0x00000800 */
#define LVDS_DMLCR2_MAP2_2                                     (0x4UL << LVDS_DMLCR2_MAP2_Pos)                                /*!< 0x00001000 */
#define LVDS_DMLCR2_MAP2_3                                     (0x8UL << LVDS_DMLCR2_MAP2_Pos)                                /*!< 0x00002000 */
#define LVDS_DMLCR2_MAP2_4                                     (0x10UL << LVDS_DMLCR2_MAP2_Pos)                                /*!< 0x00004000 */
#define LVDS_DMLCR2_MAP3_Pos                                   (15U)
#define LVDS_DMLCR2_MAP3_Msk                                   (0x1FUL << LVDS_DMLCR2_MAP3_Pos)                                  /*!< 0x000F8000 */
#define LVDS_DMLCR2_MAP3                                       LVDS_DMLCR2_MAP3_Msk                                             /*!< Mapping for bit 3 of that DataLane. */
#define LVDS_DMLCR2_MAP3_0                                     (0x1UL << LVDS_DMLCR2_MAP3_Pos)                                /*!< 0x00008000 */
#define LVDS_DMLCR2_MAP3_1                                     (0x2UL << LVDS_DMLCR2_MAP3_Pos)                               /*!< 0x00010000 */
#define LVDS_DMLCR2_MAP3_2                                     (0x4UL << LVDS_DMLCR2_MAP3_Pos)                               /*!< 0x00020000 */
#define LVDS_DMLCR2_MAP3_3                                     (0x8UL << LVDS_DMLCR2_MAP3_Pos)                               /*!< 0x00040000 */
#define LVDS_DMLCR2_MAP3_4                                     (0x10UL << LVDS_DMLCR2_MAP3_Pos)                               /*!< 0x00080000 */

/*****************  Bit definition for LVDS_DMMCR2 register  ******************/
#define LVDS_DMMCR2_MAP4_Pos                                   (0U)
#define LVDS_DMMCR2_MAP4_Msk                                   (0x1FUL << LVDS_DMMCR2_MAP4_Pos)                                  /*!< 0x0000001F */
#define LVDS_DMMCR2_MAP4                                       LVDS_DMMCR2_MAP4_Msk                                             /*!< Mapping for bit 4 of that DataLane. */
#define LVDS_DMMCR2_MAP4_0                                     (0x1UL << LVDS_DMMCR2_MAP4_Pos)                                   /*!< 0x00000001 */
#define LVDS_DMMCR2_MAP4_1                                     (0x2UL << LVDS_DMMCR2_MAP4_Pos)                                   /*!< 0x00000002 */
#define LVDS_DMMCR2_MAP4_2                                     (0x4UL << LVDS_DMMCR2_MAP4_Pos)                                   /*!< 0x00000004 */
#define LVDS_DMMCR2_MAP4_3                                     (0x8UL << LVDS_DMMCR2_MAP4_Pos)                                   /*!< 0x00000008 */
#define LVDS_DMMCR2_MAP4_4                                     (0x10UL << LVDS_DMMCR2_MAP4_Pos)                                  /*!< 0x00000010 */
#define LVDS_DMMCR2_MAP5_Pos                                   (5U)
#define LVDS_DMMCR2_MAP5_Msk                                   (0x1FUL << LVDS_DMMCR2_MAP5_Pos)                                  /*!< 0x000003E0 */
#define LVDS_DMMCR2_MAP5                                       LVDS_DMMCR2_MAP5_Msk                                             /*!< Mapping for bit 5 of that DataLane. */
#define LVDS_DMMCR2_MAP5_0                                     (0x1UL << LVDS_DMMCR2_MAP5_Pos)                                  /*!< 0x00000020 */
#define LVDS_DMMCR2_MAP5_1                                     (0x2UL << LVDS_DMMCR2_MAP5_Pos)                                  /*!< 0x00000040 */
#define LVDS_DMMCR2_MAP5_2                                     (0x4UL << LVDS_DMMCR2_MAP5_Pos)                                  /*!< 0x00000080 */
#define LVDS_DMMCR2_MAP5_3                                     (0x8UL << LVDS_DMMCR2_MAP5_Pos)                                 /*!< 0x00000100 */
#define LVDS_DMMCR2_MAP5_4                                     (0x10UL << LVDS_DMMCR2_MAP5_Pos)                                 /*!< 0x00000200 */
#define LVDS_DMMCR2_MAP6_Pos                                   (10U)
#define LVDS_DMMCR2_MAP6_Msk                                   (0x1FUL << LVDS_DMMCR2_MAP6_Pos)                                  /*!< 0x00007C00 */
#define LVDS_DMMCR2_MAP6                                       LVDS_DMMCR2_MAP6_Msk                                             /*!< Mapping for bit 6 of that DataLane. */
#define LVDS_DMMCR2_MAP6_0                                     (0x1UL << LVDS_DMMCR2_MAP6_Pos)                                 /*!< 0x00000400 */
#define LVDS_DMMCR2_MAP6_1                                     (0x2UL << LVDS_DMMCR2_MAP6_Pos)                                 /*!< 0x00000800 */
#define LVDS_DMMCR2_MAP6_2                                     (0x4UL << LVDS_DMMCR2_MAP6_Pos)                                /*!< 0x00001000 */
#define LVDS_DMMCR2_MAP6_3                                     (0x8UL << LVDS_DMMCR2_MAP6_Pos)                                /*!< 0x00002000 */
#define LVDS_DMMCR2_MAP6_4                                     (0x10UL << LVDS_DMMCR2_MAP6_Pos)                                /*!< 0x00004000 */

/*****************  Bit definition for LVDS_DMLCR3 register  ******************/
#define LVDS_DMLCR3_MAP0_Pos                                   (0U)
#define LVDS_DMLCR3_MAP0_Msk                                   (0x1FUL << LVDS_DMLCR3_MAP0_Pos)                                  /*!< 0x0000001F */
#define LVDS_DMLCR3_MAP0                                       LVDS_DMLCR3_MAP0_Msk                                             /*!< Mapping for bit 0 of that DataLane. */
#define LVDS_DMLCR3_MAP0_0                                     (0x1UL << LVDS_DMLCR3_MAP0_Pos)                                   /*!< 0x00000001 */
#define LVDS_DMLCR3_MAP0_1                                     (0x2UL << LVDS_DMLCR3_MAP0_Pos)                                   /*!< 0x00000002 */
#define LVDS_DMLCR3_MAP0_2                                     (0x4UL << LVDS_DMLCR3_MAP0_Pos)                                   /*!< 0x00000004 */
#define LVDS_DMLCR3_MAP0_3                                     (0x8UL << LVDS_DMLCR3_MAP0_Pos)                                   /*!< 0x00000008 */
#define LVDS_DMLCR3_MAP0_4                                     (0x10UL << LVDS_DMLCR3_MAP0_Pos)                                  /*!< 0x00000010 */
#define LVDS_DMLCR3_MAP1_Pos                                   (5U)
#define LVDS_DMLCR3_MAP1_Msk                                   (0x1FUL << LVDS_DMLCR3_MAP1_Pos)                                  /*!< 0x000003E0 */
#define LVDS_DMLCR3_MAP1                                       LVDS_DMLCR3_MAP1_Msk                                             /*!< Mapping for bit 1 of that DataLane. */
#define LVDS_DMLCR3_MAP1_0                                     (0x1UL << LVDS_DMLCR3_MAP1_Pos)                                  /*!< 0x00000020 */
#define LVDS_DMLCR3_MAP1_1                                     (0x2UL << LVDS_DMLCR3_MAP1_Pos)                                  /*!< 0x00000040 */
#define LVDS_DMLCR3_MAP1_2                                     (0x4UL << LVDS_DMLCR3_MAP1_Pos)                                  /*!< 0x00000080 */
#define LVDS_DMLCR3_MAP1_3                                     (0x8UL << LVDS_DMLCR3_MAP1_Pos)                                 /*!< 0x00000100 */
#define LVDS_DMLCR3_MAP1_4                                     (0x10UL << LVDS_DMLCR3_MAP1_Pos)                                 /*!< 0x00000200 */
#define LVDS_DMLCR3_MAP2_Pos                                   (10U)
#define LVDS_DMLCR3_MAP2_Msk                                   (0x1FUL << LVDS_DMLCR3_MAP2_Pos)                                  /*!< 0x00007C00 */
#define LVDS_DMLCR3_MAP2                                       LVDS_DMLCR3_MAP2_Msk                                             /*!< Mapping for bit 2 of that DataLane. */
#define LVDS_DMLCR3_MAP2_0                                     (0x1UL << LVDS_DMLCR3_MAP2_Pos)                                 /*!< 0x00000400 */
#define LVDS_DMLCR3_MAP2_1                                     (0x2UL << LVDS_DMLCR3_MAP2_Pos)                                 /*!< 0x00000800 */
#define LVDS_DMLCR3_MAP2_2                                     (0x4UL << LVDS_DMLCR3_MAP2_Pos)                                /*!< 0x00001000 */
#define LVDS_DMLCR3_MAP2_3                                     (0x8UL << LVDS_DMLCR3_MAP2_Pos)                                /*!< 0x00002000 */
#define LVDS_DMLCR3_MAP2_4                                     (0x10UL << LVDS_DMLCR3_MAP2_Pos)                                /*!< 0x00004000 */
#define LVDS_DMLCR3_MAP3_Pos                                   (15U)
#define LVDS_DMLCR3_MAP3_Msk                                   (0x1FUL << LVDS_DMLCR3_MAP3_Pos)                                  /*!< 0x000F8000 */
#define LVDS_DMLCR3_MAP3                                       LVDS_DMLCR3_MAP3_Msk                                             /*!< Mapping for bit 3 of that DataLane. */
#define LVDS_DMLCR3_MAP3_0                                     (0x1UL << LVDS_DMLCR3_MAP3_Pos)                                /*!< 0x00008000 */
#define LVDS_DMLCR3_MAP3_1                                     (0x2UL << LVDS_DMLCR3_MAP3_Pos)                               /*!< 0x00010000 */
#define LVDS_DMLCR3_MAP3_2                                     (0x4UL << LVDS_DMLCR3_MAP3_Pos)                               /*!< 0x00020000 */
#define LVDS_DMLCR3_MAP3_3                                     (0x8UL << LVDS_DMLCR3_MAP3_Pos)                               /*!< 0x00040000 */
#define LVDS_DMLCR3_MAP3_4                                     (0x10UL << LVDS_DMLCR3_MAP3_Pos)                               /*!< 0x00080000 */

