STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255fxx_cm33.h
/*****************  Bit definition for LVDS_PMMBCSR register  *****************/
#define LVDS_PMMBCSR_MST_MON_BG_CURR_PERMANENT_FAULT_Pos       (0U)
#define LVDS_PMMBCSR_MST_MON_BG_CURR_PERMANENT_FAULT_Msk       (0x1UL << LVDS_PMMBCSR_MST_MON_BG_CURR_PERMANENT_FAULT_Pos)       /*!< 0x00000001 */
#define LVDS_PMMBCSR_MST_MON_BG_CURR_PERMANENT_FAULT           LVDS_PMMBCSR_MST_MON_BG_CURR_PERMANENT_FAULT_Msk                 /*!< Bandgap current monitor permanent fault */
#define LVDS_PMMBCSR_MST_MON_BG_CURR_FAULT_Pos                 (4U)
#define LVDS_PMMBCSR_MST_MON_BG_CURR_FAULT_Msk                 (0x1UL << LVDS_PMMBCSR_MST_MON_BG_CURR_FAULT_Pos)                 /*!< 0x00000010 */
#define LVDS_PMMBCSR_MST_MON_BG_CURR_FAULT                     LVDS_PMMBCSR_MST_MON_BG_CURR_FAULT_Msk                           /*!< Bandgap current monitor fault */

/*****************  Bit definition for LVDS_PMMBLCR register  *****************/
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_FORCE_FAULT_Pos           (0U)
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_FORCE_FAULT_Msk           (0x1UL << LVDS_PMMBLCR_MST_MON_BG_LOOP_FORCE_FAULT_Pos)           /*!< 0x00000001 */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_FORCE_FAULT               LVDS_PMMBLCR_MST_MON_BG_LOOP_FORCE_FAULT_Msk                     /*!< Bandgap loop monitor force fault */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_CLEAR_FAULT_Pos           (4U)
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_CLEAR_FAULT_Msk           (0x1UL << LVDS_PMMBLCR_MST_MON_BG_LOOP_CLEAR_FAULT_Pos)           /*!< 0x00000010 */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_CLEAR_FAULT               LVDS_PMMBLCR_MST_MON_BG_LOOP_CLEAR_FAULT_Msk                     /*!< Bandgap loop monitor clear fault */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Pos           (16U)
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Msk           (0x1FFUL << LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Pos)         /*!< 0x01FF0000 */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE               LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Msk                     /*!< Bandgap loop timing control for the monitor unmask after startup */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_0             (0x1UL << LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Pos)       /*!< 0x00010000 */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_1             (0x2UL << LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Pos)       /*!< 0x00020000 */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_2             (0x4UL << LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Pos)       /*!< 0x00040000 */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_3             (0x8UL << LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Pos)       /*!< 0x00080000 */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_4             (0x10UL << LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Pos)      /*!< 0x00100000 */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_5             (0x20UL << LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Pos)      /*!< 0x00200000 */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_6             (0x40UL << LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Pos)      /*!< 0x00400000 */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_7             (0x80UL << LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Pos)      /*!< 0x00800000 */
#define LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_8             (0x100UL << LVDS_PMMBLCR_MST_MON_BG_LOOP_UNMASK_TUNE_Pos)     /*!< 0x01000000 */

/*****************  Bit definition for LVDS_PMMBLSR register  *****************/
#define LVDS_PMMBLSR_MST_MON_BG_LOOP_PERMANENT_FAULT_Pos       (0U)
#define LVDS_PMMBLSR_MST_MON_BG_LOOP_PERMANENT_FAULT_Msk       (0x1UL << LVDS_PMMBLSR_MST_MON_BG_LOOP_PERMANENT_FAULT_Pos)       /*!< 0x00000001 */
#define LVDS_PMMBLSR_MST_MON_BG_LOOP_PERMANENT_FAULT           LVDS_PMMBLSR_MST_MON_BG_LOOP_PERMANENT_FAULT_Msk                 /*!< Bandgap loop monitor permanent fault */
#define LVDS_PMMBLSR_MST_MON_BG_LOOP_FAULT_Pos                 (4U)
#define LVDS_PMMBLSR_MST_MON_BG_LOOP_FAULT_Msk                 (0x1UL << LVDS_PMMBLSR_MST_MON_BG_LOOP_FAULT_Pos)                 /*!< 0x00000010 */
#define LVDS_PMMBLSR_MST_MON_BG_LOOP_FAULT                     LVDS_PMMBLSR_MST_MON_BG_LOOP_FAULT_Msk                           /*!< Bandgap loop monitor fault */

/****************  Bit definition for LVDS_PMMBOVCR register  *****************/
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_FORCE_FAULT_Pos          (0U)
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_FORCE_FAULT_Msk          (0x1UL << LVDS_PMMBOVCR_MST_MON_BG_VOLT_FORCE_FAULT_Pos)          /*!< 0x00000001 */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_FORCE_FAULT              LVDS_PMMBOVCR_MST_MON_BG_VOLT_FORCE_FAULT_Msk                    /*!< Bandgap output voltage monitor force fault */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_CLEAR_FAULT_Pos          (4U)
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_CLEAR_FAULT_Msk          (0x1UL << LVDS_PMMBOVCR_MST_MON_BG_VOLT_CLEAR_FAULT_Pos)          /*!< 0x00000010 */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_CLEAR_FAULT              LVDS_PMMBOVCR_MST_MON_BG_VOLT_CLEAR_FAULT_Msk                    /*!< Bandgap output voltage monitor clear fault */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Pos          (16U)
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Msk          (0x1FFUL << LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Pos)        /*!< 0x01FF0000 */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE              LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Msk                    /*!< Bandgap output voltage timing control for the monitor unmask after startup */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_0            (0x1UL << LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Pos)      /*!< 0x00010000 */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_1            (0x2UL << LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Pos)      /*!< 0x00020000 */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_2            (0x4UL << LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Pos)      /*!< 0x00040000 */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_3            (0x8UL << LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Pos)      /*!< 0x00080000 */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_4            (0x10UL << LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Pos)     /*!< 0x00100000 */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_5            (0x20UL << LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Pos)     /*!< 0x00200000 */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_6            (0x40UL << LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Pos)     /*!< 0x00400000 */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_7            (0x80UL << LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Pos)     /*!< 0x00800000 */
#define LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_8            (0x100UL << LVDS_PMMBOVCR_MST_MON_BG_VOLT_UNMASK_TUNE_Pos)    /*!< 0x01000000 */

/****************  Bit definition for LVDS_PMMBOVSR register  *****************/
#define LVDS_PMMBOVSR_MST_MON_BG_VOLT_PERMANENT_FAULT_Pos      (0U)
#define LVDS_PMMBOVSR_MST_MON_BG_VOLT_PERMANENT_FAULT_Msk      (0x1UL << LVDS_PMMBOVSR_MST_MON_BG_VOLT_PERMANENT_FAULT_Pos)      /*!< 0x00000001 */
#define LVDS_PMMBOVSR_MST_MON_BG_VOLT_PERMANENT_FAULT          LVDS_PMMBOVSR_MST_MON_BG_VOLT_PERMANENT_FAULT_Msk                /*!< Bandgap output voltage monitor permanent fault */
#define LVDS_PMMBOVSR_MST_MON_BG_VOLT_FAULT_Pos                (4U)
#define LVDS_PMMBOVSR_MST_MON_BG_VOLT_FAULT_Msk                (0x1UL << LVDS_PMMBOVSR_MST_MON_BG_VOLT_FAULT_Pos)                /*!< 0x00000010 */
#define LVDS_PMMBOVSR_MST_MON_BG_VOLT_FAULT                    LVDS_PMMBOVSR_MST_MON_BG_VOLT_FAULT_Msk                          /*!< Bandgap output voltage monitor fault */

