STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255fxx_cm33.h
/****************  Bit definition for LVDS_PMMPLOVCR register  ****************/
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_FORCE_FAULT_Pos          (0U)
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_FORCE_FAULT_Msk          (0x1UL << LVDS_PMMPLOVCR_MST_MON_LDO_OK_FORCE_FAULT_Pos)          /*!< 0x00000001 */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_FORCE_FAULT              LVDS_PMMPLOVCR_MST_MON_LDO_OK_FORCE_FAULT_Msk                    /*!< PLL LDO output voltage monitor force fault */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_CLEAR_FAULT_Pos          (4U)
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_CLEAR_FAULT_Msk          (0x1UL << LVDS_PMMPLOVCR_MST_MON_LDO_OK_CLEAR_FAULT_Pos)          /*!< 0x00000010 */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_CLEAR_FAULT              LVDS_PMMPLOVCR_MST_MON_LDO_OK_CLEAR_FAULT_Msk                    /*!< PLL LDO output voltage monitor clear fault */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Pos          (16U)
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Msk          (0x1FFUL << LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Pos)        /*!< 0x01FF0000 */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE              LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Msk                    /*!< PLL LDO output voltage timing control for the monitor unmask after startup */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_0            (0x1UL << LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Pos)      /*!< 0x00010000 */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_1            (0x2UL << LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Pos)      /*!< 0x00020000 */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_2            (0x4UL << LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Pos)      /*!< 0x00040000 */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_3            (0x8UL << LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Pos)      /*!< 0x00080000 */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_4            (0x10UL << LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Pos)     /*!< 0x00100000 */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_5            (0x20UL << LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Pos)     /*!< 0x00200000 */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_6            (0x40UL << LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Pos)     /*!< 0x00400000 */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_7            (0x80UL << LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Pos)     /*!< 0x00800000 */
#define LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_8            (0x100UL << LVDS_PMMPLOVCR_MST_MON_LDO_OK_UNMASK_TUNE_Pos)    /*!< 0x01000000 */

/****************  Bit definition for LVDS_PMMPLOVSR register  ****************/
#define LVDS_PMMPLOVSR_MST_MON_LDO_OK_PERMANENT_FAULT_Pos      (0U)
#define LVDS_PMMPLOVSR_MST_MON_LDO_OK_PERMANENT_FAULT_Msk      (0x1UL << LVDS_PMMPLOVSR_MST_MON_LDO_OK_PERMANENT_FAULT_Pos)      /*!< 0x00000001 */
#define LVDS_PMMPLOVSR_MST_MON_LDO_OK_PERMANENT_FAULT          LVDS_PMMPLOVSR_MST_MON_LDO_OK_PERMANENT_FAULT_Msk                /*!< PLL LDO Output Voltage monitor permanent fault */
#define LVDS_PMMPLOVSR_MST_MON_LDO_OK_FAULT_Pos                (4U)
#define LVDS_PMMPLOVSR_MST_MON_LDO_OK_FAULT_Msk                (0x1UL << LVDS_PMMPLOVSR_MST_MON_LDO_OK_FAULT_Pos)                /*!< 0x00000010 */
#define LVDS_PMMPLOVSR_MST_MON_LDO_OK_FAULT                    LVDS_PMMPLOVSR_MST_MON_LDO_OK_FAULT_Msk                          /*!< PLL LDO output voltage monitor fault */

/*****************  Bit definition for LVDS_PMMPLCR register  *****************/
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_FORCE_FAULT_Pos          (0U)
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_FORCE_FAULT_Msk          (0x1UL << LVDS_PMMPLCR_MST_MON_PLL_LOCK_FORCE_FAULT_Pos)          /*!< 0x00000001 */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_FORCE_FAULT              LVDS_PMMPLCR_MST_MON_PLL_LOCK_FORCE_FAULT_Msk                    /*!< PLL Lock monitor force fault */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_CLEAR_FAULT_Pos          (4U)
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_CLEAR_FAULT_Msk          (0x1UL << LVDS_PMMPLCR_MST_MON_PLL_LOCK_CLEAR_FAULT_Pos)          /*!< 0x00000010 */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_CLEAR_FAULT              LVDS_PMMPLCR_MST_MON_PLL_LOCK_CLEAR_FAULT_Msk                    /*!< PLL Lock monitor clear fault */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Pos          (16U)
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Msk          (0x1FFUL << LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Pos)        /*!< 0x01FF0000 */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE              LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Msk                    /*!< PLL Lock timing control for the monitor unmask after startup */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_0            (0x1UL << LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Pos)      /*!< 0x00010000 */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_1            (0x2UL << LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Pos)      /*!< 0x00020000 */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_2            (0x4UL << LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Pos)      /*!< 0x00040000 */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_3            (0x8UL << LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Pos)      /*!< 0x00080000 */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_4            (0x10UL << LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Pos)     /*!< 0x00100000 */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_5            (0x20UL << LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Pos)     /*!< 0x00200000 */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_6            (0x40UL << LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Pos)     /*!< 0x00400000 */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_7            (0x80UL << LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Pos)     /*!< 0x00800000 */
#define LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_8            (0x100UL << LVDS_PMMPLCR_MST_MON_PLL_LOCK_UNMASK_TUNE_Pos)    /*!< 0x01000000 */

/*****************  Bit definition for LVDS_PMMPLSR register  *****************/
#define LVDS_PMMPLSR_MST_MON_PLL_LOCK_PERMANENT_FAULT_Pos      (0U)
#define LVDS_PMMPLSR_MST_MON_PLL_LOCK_PERMANENT_FAULT_Msk      (0x1UL << LVDS_PMMPLSR_MST_MON_PLL_LOCK_PERMANENT_FAULT_Pos)      /*!< 0x00000001 */
#define LVDS_PMMPLSR_MST_MON_PLL_LOCK_PERMANENT_FAULT          LVDS_PMMPLSR_MST_MON_PLL_LOCK_PERMANENT_FAULT_Msk                /*!< PLL Lock monitor permanent fault */
#define LVDS_PMMPLSR_MST_MON_PLL_LOCK_FAULT_Pos                (4U)
#define LVDS_PMMPLSR_MST_MON_PLL_LOCK_FAULT_Msk                (0x1UL << LVDS_PMMPLSR_MST_MON_PLL_LOCK_FAULT_Pos)                /*!< 0x00000010 */
#define LVDS_PMMPLSR_MST_MON_PLL_LOCK_FAULT                    LVDS_PMMPLSR_MST_MON_PLL_LOCK_FAULT_Msk                          /*!< PLL Lock monitor fault */

/****************  Bit definition for LVDS_PMMPROCR register  *****************/
#define LVDS_PMMPROCR_MST_MON_REF_OK_FORCE_FAULT_Pos           (0U)
#define LVDS_PMMPROCR_MST_MON_REF_OK_FORCE_FAULT_Msk           (0x1UL << LVDS_PMMPROCR_MST_MON_REF_OK_FORCE_FAULT_Pos)           /*!< 0x00000001 */
#define LVDS_PMMPROCR_MST_MON_REF_OK_FORCE_FAULT               LVDS_PMMPROCR_MST_MON_REF_OK_FORCE_FAULT_Msk                     /*!< PLL Reference monitor force fault */
#define LVDS_PMMPROCR_MST_MON_REF_OK_CLEAR_FAULT_Pos           (4U)
#define LVDS_PMMPROCR_MST_MON_REF_OK_CLEAR_FAULT_Msk           (0x1UL << LVDS_PMMPROCR_MST_MON_REF_OK_CLEAR_FAULT_Pos)           /*!< 0x00000010 */
#define LVDS_PMMPROCR_MST_MON_REF_OK_CLEAR_FAULT               LVDS_PMMPROCR_MST_MON_REF_OK_CLEAR_FAULT_Msk                     /*!< PLL Reference monitor clear fault */
#define LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Pos           (16U)
#define LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Msk           (0x1FFUL << LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Pos)         /*!< 0x01FF0000 */
#define LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE               LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Msk                     /*!< PLL Reference timing control for the monitor unmask after startup */
#define LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_0             (0x1UL << LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Pos)       /*!< 0x00010000 */
#define LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_1             (0x2UL << LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Pos)       /*!< 0x00020000 */
#define LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_2             (0x4UL << LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Pos)       /*!< 0x00040000 */
#define LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_3             (0x8UL << LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Pos)       /*!< 0x00080000 */
#define LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_4             (0x10UL << LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Pos)      /*!< 0x00100000 */
#define LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_5             (0x20UL << LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Pos)      /*!< 0x00200000 */
#define LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_6             (0x40UL << LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Pos)      /*!< 0x00400000 */
#define LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_7             (0x80UL << LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Pos)      /*!< 0x00800000 */
#define LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_8             (0x100UL << LVDS_PMMPROCR_MST_MON_REF_OK_UNMASK_TUNE_Pos)     /*!< 0x01000000 */

/****************  Bit definition for LVDS_PMMPROSR register  *****************/
#define LVDS_PMMPROSR_MST_MON_REF_OK_PERMANENT_FAULT_Pos       (0U)
#define LVDS_PMMPROSR_MST_MON_REF_OK_PERMANENT_FAULT_Msk       (0x1UL << LVDS_PMMPROSR_MST_MON_REF_OK_PERMANENT_FAULT_Pos)       /*!< 0x00000001 */
#define LVDS_PMMPROSR_MST_MON_REF_OK_PERMANENT_FAULT           LVDS_PMMPROSR_MST_MON_REF_OK_PERMANENT_FAULT_Msk                 /*!< PLL Reference OK monitor permanent fault */
#define LVDS_PMMPROSR_MST_MON_REF_OK_FAULT_Pos                 (4U)
#define LVDS_PMMPROSR_MST_MON_REF_OK_FAULT_Msk                 (0x1UL << LVDS_PMMPROSR_MST_MON_REF_OK_FAULT_Pos)                 /*!< 0x00000010 */
#define LVDS_PMMPROSR_MST_MON_REF_OK_FAULT                     LVDS_PMMPROSR_MST_MON_REF_OK_FAULT_Msk                           /*!< PLL Reference OK monitor fault */

/*****************  Bit definition for LVDS_PMMSCCR register  *****************/
#define LVDS_PMMSCCR_MST_SER_CLK_ERROR_INJ_Pos                 (0U)
#define LVDS_PMMSCCR_MST_SER_CLK_ERROR_INJ_Msk                 (0x1UL << LVDS_PMMSCCR_MST_SER_CLK_ERROR_INJ_Pos)                 /*!< 0x00000001 */
#define LVDS_PMMSCCR_MST_SER_CLK_ERROR_INJ                     LVDS_PMMSCCR_MST_SER_CLK_ERROR_INJ_Msk                           /*!< Serializer clock checking error injection */
#define LVDS_PMMSCCR_MST_SER_CLK_CLEAR_FAULT_Pos               (4U)
#define LVDS_PMMSCCR_MST_SER_CLK_CLEAR_FAULT_Msk               (0x1UL << LVDS_PMMSCCR_MST_SER_CLK_CLEAR_FAULT_Pos)               /*!< 0x00000010 */
#define LVDS_PMMSCCR_MST_SER_CLK_CLEAR_FAULT                   LVDS_PMMSCCR_MST_SER_CLK_CLEAR_FAULT_Msk                         /*!< Serializer Clock checking fault clearing */

/*****************  Bit definition for LVDS_PMMSCSR register  *****************/
#define LVDS_PMMSCSR_MST_SER_CLK_FAULT_Pos                     (0U)
#define LVDS_PMMSCSR_MST_SER_CLK_FAULT_Msk                     (0x1UL << LVDS_PMMSCSR_MST_SER_CLK_FAULT_Pos)                     /*!< 0x00000001 */
#define LVDS_PMMSCSR_MST_SER_CLK_FAULT                         LVDS_PMMSCSR_MST_SER_CLK_FAULT_Msk                               /*!< Serializer Clock checking fault */

