STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255fxx_cm33.h
/***************  Bit definition for LVDS_PSPLLTWGCR2 register  ***************/
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos             (0U)
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Msk             (0x7FFFFFUL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)        /*!< 0x007FFFFF */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD                 LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Msk                       /*!< TWG_THRESHOLD setting */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_0               (0x1UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)             /*!< 0x00000001 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_1               (0x2UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)             /*!< 0x00000002 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_2               (0x4UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)             /*!< 0x00000004 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_3               (0x8UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)             /*!< 0x00000008 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_4               (0x10UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)            /*!< 0x00000010 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_5               (0x20UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)            /*!< 0x00000020 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_6               (0x40UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)            /*!< 0x00000040 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_7               (0x80UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)            /*!< 0x00000080 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_8               (0x100UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)           /*!< 0x00000100 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_9               (0x200UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)           /*!< 0x00000200 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_10              (0x400UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)           /*!< 0x00000400 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_11              (0x800UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)           /*!< 0x00000800 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_12              (0x1000UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)          /*!< 0x00001000 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_13              (0x2000UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)          /*!< 0x00002000 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_14              (0x4000UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)          /*!< 0x00004000 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_15              (0x8000UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)          /*!< 0x00008000 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_16              (0x10000UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)         /*!< 0x00010000 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_17              (0x20000UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)         /*!< 0x00020000 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_18              (0x40000UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)         /*!< 0x00040000 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_19              (0x80000UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)         /*!< 0x00080000 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_20              (0x100000UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)        /*!< 0x00100000 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_21              (0x200000UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)        /*!< 0x00200000 */
#define LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_22              (0x400000UL << LVDS_PSPLLTWGCR2_SLV_PLL_TWG_THRESHOLD_Pos)        /*!< 0x00400000 */

/***************  Bit definition for LVDS_PSPLLLDOCR register  ****************/
#define LVDS_PSPLLLDOCR_SLV_PLL_LDO_FRREGVTRIM_Pos             (0U)
#define LVDS_PSPLLLDOCR_SLV_PLL_LDO_FRREGVTRIM_Msk             (0x7UL << LVDS_PSPLLLDOCR_SLV_PLL_LDO_FRREGVTRIM_Pos)             /*!< 0x00000007 */
#define LVDS_PSPLLLDOCR_SLV_PLL_LDO_FRREGVTRIM                 LVDS_PSPLLLDOCR_SLV_PLL_LDO_FRREGVTRIM_Msk                       /*!< PLL LDO output voltage fine tuning: */
#define LVDS_PSPLLLDOCR_SLV_PLL_LDO_FRREGVTRIM_0               (0x1UL << LVDS_PSPLLLDOCR_SLV_PLL_LDO_FRREGVTRIM_Pos)             /*!< 0x00000001 */
#define LVDS_PSPLLLDOCR_SLV_PLL_LDO_FRREGVTRIM_1               (0x2UL << LVDS_PSPLLLDOCR_SLV_PLL_LDO_FRREGVTRIM_Pos)             /*!< 0x00000002 */
#define LVDS_PSPLLLDOCR_SLV_PLL_LDO_FRREGVTRIM_2               (0x4UL << LVDS_PSPLLLDOCR_SLV_PLL_LDO_FRREGVTRIM_Pos)             /*!< 0x00000004 */

/****************  Bit definition for LVDS_PSPLLCPCR register  ****************/
#define LVDS_PSPLLCPCR_SLV_PLL_CPCTRL_Pos                      (0U)
#define LVDS_PSPLLCPCR_SLV_PLL_CPCTRL_Msk                      (0xFUL << LVDS_PSPLLCPCR_SLV_PLL_CPCTRL_Pos)                      /*!< 0x0000000F */
#define LVDS_PSPLLCPCR_SLV_PLL_CPCTRL                          LVDS_PSPLLCPCR_SLV_PLL_CPCTRL_Msk                                /*!< PLL charge pump control, default=1. */
#define LVDS_PSPLLCPCR_SLV_PLL_CPCTRL_0                        (0x1UL << LVDS_PSPLLCPCR_SLV_PLL_CPCTRL_Pos)                      /*!< 0x00000001 */
#define LVDS_PSPLLCPCR_SLV_PLL_CPCTRL_1                        (0x2UL << LVDS_PSPLLCPCR_SLV_PLL_CPCTRL_Pos)                      /*!< 0x00000002 */
#define LVDS_PSPLLCPCR_SLV_PLL_CPCTRL_2                        (0x4UL << LVDS_PSPLLCPCR_SLV_PLL_CPCTRL_Pos)                      /*!< 0x00000004 */
#define LVDS_PSPLLCPCR_SLV_PLL_CPCTRL_3                        (0x8UL << LVDS_PSPLLCPCR_SLV_PLL_CPCTRL_Pos)                      /*!< 0x00000008 */

/***************  Bit definition for LVDS_PSPLLCFGCR register  ****************/
#define LVDS_PSPLLCFGCR_SLV_PLL_CFG_Pos                        (0U)
#define LVDS_PSPLLCFGCR_SLV_PLL_CFG_Msk                        (0xFFUL << LVDS_PSPLLCFGCR_SLV_PLL_CFG_Pos)                       /*!< 0x000000FF */
#define LVDS_PSPLLCFGCR_SLV_PLL_CFG                            LVDS_PSPLLCFGCR_SLV_PLL_CFG_Msk                                  /*!< PLL configuration */
#define LVDS_PSPLLCFGCR_SLV_PLL_CFG_0                          (0x1UL << LVDS_PSPLLCFGCR_SLV_PLL_CFG_Pos)                        /*!< 0x00000001 */
#define LVDS_PSPLLCFGCR_SLV_PLL_CFG_1                          (0x2UL << LVDS_PSPLLCFGCR_SLV_PLL_CFG_Pos)                        /*!< 0x00000002 */
#define LVDS_PSPLLCFGCR_SLV_PLL_CFG_2                          (0x4UL << LVDS_PSPLLCFGCR_SLV_PLL_CFG_Pos)                        /*!< 0x00000004 */
#define LVDS_PSPLLCFGCR_SLV_PLL_CFG_3                          (0x8UL << LVDS_PSPLLCFGCR_SLV_PLL_CFG_Pos)                        /*!< 0x00000008 */
#define LVDS_PSPLLCFGCR_SLV_PLL_CFG_4                          (0x10UL << LVDS_PSPLLCFGCR_SLV_PLL_CFG_Pos)                       /*!< 0x00000010 */
#define LVDS_PSPLLCFGCR_SLV_PLL_CFG_5                          (0x20UL << LVDS_PSPLLCFGCR_SLV_PLL_CFG_Pos)                       /*!< 0x00000020 */
#define LVDS_PSPLLCFGCR_SLV_PLL_CFG_6                          (0x40UL << LVDS_PSPLLCFGCR_SLV_PLL_CFG_Pos)                       /*!< 0x00000040 */
#define LVDS_PSPLLCFGCR_SLV_PLL_CFG_7                          (0x80UL << LVDS_PSPLLCFGCR_SLV_PLL_CFG_Pos)                       /*!< 0x00000080 */

/***************  Bit definition for LVDS_PSPLLTESTCR register  ***************/
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_CLK_EN_Pos               (0U)
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_CLK_EN_Msk               (0x1UL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_CLK_EN_Pos)               /*!< 0x00000001 */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_CLK_EN                   LVDS_PSPLLTESTCR_SLV_PLL_TEST_CLK_EN_Msk                         /*!< lvds_pll_test_clk enable */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_EN_Pos               (8U)
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_EN_Msk               (0x1UL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_EN_Pos)               /*!< 0x00000100 */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_EN                   LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_EN_Msk                         /*!< lvds_pll_test_clk dividers enable */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos         (16U)
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Msk         (0x3FFUL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos)       /*!< 0x03FF0000 */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS             LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Msk                   /*!< lvds_pll_test_clk dividers value */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_0           (0x1UL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos)     /*!< 0x00010000 */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_1           (0x2UL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos)     /*!< 0x00020000 */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_2           (0x4UL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos)     /*!< 0x00040000 */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_3           (0x8UL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos)     /*!< 0x00080000 */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_4           (0x10UL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos)    /*!< 0x00100000 */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_5           (0x20UL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos)    /*!< 0x00200000 */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_6           (0x40UL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos)    /*!< 0x00400000 */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_7           (0x80UL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos)    /*!< 0x00800000 */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_8           (0x100UL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos)   /*!< 0x01000000 */
#define LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_9           (0x200UL << LVDS_PSPLLTESTCR_SLV_PLL_TEST_DIV_SETTINGS_Pos)   /*!< 0x02000000 */

/*****************  Bit definition for LVDS_PMATCR1 register  *****************/
#define LVDS_PMATCR1_PMATDL0_Pos                               (0U)
#define LVDS_PMATCR1_PMATDL0_Msk                               (0xFFUL << LVDS_PMATCR1_PMATDL0_Pos)                              /*!< 0x000000FF */
#define LVDS_PMATCR1_PMATDL0                                   LVDS_PMATCR1_PMATDL0_Msk                                         /*!< PHY Master Analog Test Data Lane 0. */
#define LVDS_PMATCR1_PMATDL0_0                                 (0x1UL << LVDS_PMATCR1_PMATDL0_Pos)                               /*!< 0x00000001 */
#define LVDS_PMATCR1_PMATDL0_1                                 (0x2UL << LVDS_PMATCR1_PMATDL0_Pos)                               /*!< 0x00000002 */
#define LVDS_PMATCR1_PMATDL0_2                                 (0x4UL << LVDS_PMATCR1_PMATDL0_Pos)                               /*!< 0x00000004 */
#define LVDS_PMATCR1_PMATDL0_3                                 (0x8UL << LVDS_PMATCR1_PMATDL0_Pos)                               /*!< 0x00000008 */
#define LVDS_PMATCR1_PMATDL0_4                                 (0x10UL << LVDS_PMATCR1_PMATDL0_Pos)                              /*!< 0x00000010 */
#define LVDS_PMATCR1_PMATDL0_5                                 (0x20UL << LVDS_PMATCR1_PMATDL0_Pos)                              /*!< 0x00000020 */
#define LVDS_PMATCR1_PMATDL0_6                                 (0x40UL << LVDS_PMATCR1_PMATDL0_Pos)                              /*!< 0x00000040 */
#define LVDS_PMATCR1_PMATDL0_7                                 (0x80UL << LVDS_PMATCR1_PMATDL0_Pos)                              /*!< 0x00000080 */
#define LVDS_PMATCR1_PMATDL1_Pos                               (8U)
#define LVDS_PMATCR1_PMATDL1_Msk                               (0xFFUL << LVDS_PMATCR1_PMATDL1_Pos)                              /*!< 0x0000FF00 */
#define LVDS_PMATCR1_PMATDL1                                   LVDS_PMATCR1_PMATDL1_Msk                                         /*!< PHY Master Analog Test Data Lane 1. */
#define LVDS_PMATCR1_PMATDL1_0                                 (0x1UL << LVDS_PMATCR1_PMATDL1_Pos)                             /*!< 0x00000100 */
#define LVDS_PMATCR1_PMATDL1_1                                 (0x2UL << LVDS_PMATCR1_PMATDL1_Pos)                             /*!< 0x00000200 */
#define LVDS_PMATCR1_PMATDL1_2                                 (0x4UL << LVDS_PMATCR1_PMATDL1_Pos)                             /*!< 0x00000400 */
#define LVDS_PMATCR1_PMATDL1_3                                 (0x8UL << LVDS_PMATCR1_PMATDL1_Pos)                             /*!< 0x00000800 */
#define LVDS_PMATCR1_PMATDL1_4                                 (0x10UL << LVDS_PMATCR1_PMATDL1_Pos)                            /*!< 0x00001000 */
#define LVDS_PMATCR1_PMATDL1_5                                 (0x20UL << LVDS_PMATCR1_PMATDL1_Pos)                            /*!< 0x00002000 */
#define LVDS_PMATCR1_PMATDL1_6                                 (0x40UL << LVDS_PMATCR1_PMATDL1_Pos)                            /*!< 0x00004000 */
#define LVDS_PMATCR1_PMATDL1_7                                 (0x80UL << LVDS_PMATCR1_PMATDL1_Pos)                            /*!< 0x00008000 */
#define LVDS_PMATCR1_PMATDL2_Pos                               (16U)
#define LVDS_PMATCR1_PMATDL2_Msk                               (0xFFUL << LVDS_PMATCR1_PMATDL2_Pos)                              /*!< 0x00FF0000 */
#define LVDS_PMATCR1_PMATDL2                                   LVDS_PMATCR1_PMATDL2_Msk                                         /*!< PHY Master Analog Test Data Lane 2. */
#define LVDS_PMATCR1_PMATDL2_0                                 (0x1UL << LVDS_PMATCR1_PMATDL2_Pos)                           /*!< 0x00010000 */
#define LVDS_PMATCR1_PMATDL2_1                                 (0x2UL << LVDS_PMATCR1_PMATDL2_Pos)                           /*!< 0x00020000 */
#define LVDS_PMATCR1_PMATDL2_2                                 (0x4UL << LVDS_PMATCR1_PMATDL2_Pos)                           /*!< 0x00040000 */
#define LVDS_PMATCR1_PMATDL2_3                                 (0x8UL << LVDS_PMATCR1_PMATDL2_Pos)                           /*!< 0x00080000 */
#define LVDS_PMATCR1_PMATDL2_4                                 (0x10UL << LVDS_PMATCR1_PMATDL2_Pos)                          /*!< 0x00100000 */
#define LVDS_PMATCR1_PMATDL2_5                                 (0x20UL << LVDS_PMATCR1_PMATDL2_Pos)                          /*!< 0x00200000 */
#define LVDS_PMATCR1_PMATDL2_6                                 (0x40UL << LVDS_PMATCR1_PMATDL2_Pos)                          /*!< 0x00400000 */
#define LVDS_PMATCR1_PMATDL2_7                                 (0x80UL << LVDS_PMATCR1_PMATDL2_Pos)                          /*!< 0x00800000 */
#define LVDS_PMATCR1_PMATDL3_Pos                               (24U)
#define LVDS_PMATCR1_PMATDL3_Msk                               (0xFFUL << LVDS_PMATCR1_PMATDL3_Pos)                              /*!< 0xFF000000 */
#define LVDS_PMATCR1_PMATDL3                                   LVDS_PMATCR1_PMATDL3_Msk                                         /*!< PHY Master Analog Test Data Lane 3. */
#define LVDS_PMATCR1_PMATDL3_0                                 (0x1UL << LVDS_PMATCR1_PMATDL3_Pos)                         /*!< 0x01000000 */
#define LVDS_PMATCR1_PMATDL3_1                                 (0x2UL << LVDS_PMATCR1_PMATDL3_Pos)                         /*!< 0x02000000 */
#define LVDS_PMATCR1_PMATDL3_2                                 (0x4UL << LVDS_PMATCR1_PMATDL3_Pos)                         /*!< 0x04000000 */
#define LVDS_PMATCR1_PMATDL3_3                                 (0x8UL << LVDS_PMATCR1_PMATDL3_Pos)                         /*!< 0x08000000 */
#define LVDS_PMATCR1_PMATDL3_4                                 (0x10UL << LVDS_PMATCR1_PMATDL3_Pos)                        /*!< 0x10000000 */
#define LVDS_PMATCR1_PMATDL3_5                                 (0x20UL << LVDS_PMATCR1_PMATDL3_Pos)                        /*!< 0x20000000 */
#define LVDS_PMATCR1_PMATDL3_6                                 (0x40UL << LVDS_PMATCR1_PMATDL3_Pos)                        /*!< 0x40000000 */
#define LVDS_PMATCR1_PMATDL3_7                                 (0x80UL << LVDS_PMATCR1_PMATDL3_Pos)                        /*!< 0x80000000 */

/*****************  Bit definition for LVDS_PMATCR2 register  *****************/
#define LVDS_PMATCR2_PMATDL4_Pos                               (0U)
#define LVDS_PMATCR2_PMATDL4_Msk                               (0xFFUL << LVDS_PMATCR2_PMATDL4_Pos)                              /*!< 0x000000FF */
#define LVDS_PMATCR2_PMATDL4                                   LVDS_PMATCR2_PMATDL4_Msk                                         /*!< PHY Master Analog Test Data Lane 4. */
#define LVDS_PMATCR2_PMATDL4_0                                 (0x1UL << LVDS_PMATCR2_PMATDL4_Pos)                               /*!< 0x00000001 */
#define LVDS_PMATCR2_PMATDL4_1                                 (0x2UL << LVDS_PMATCR2_PMATDL4_Pos)                               /*!< 0x00000002 */
#define LVDS_PMATCR2_PMATDL4_2                                 (0x4UL << LVDS_PMATCR2_PMATDL4_Pos)                               /*!< 0x00000004 */
#define LVDS_PMATCR2_PMATDL4_3                                 (0x8UL << LVDS_PMATCR2_PMATDL4_Pos)                               /*!< 0x00000008 */
#define LVDS_PMATCR2_PMATDL4_4                                 (0x10UL << LVDS_PMATCR2_PMATDL4_Pos)                              /*!< 0x00000010 */
#define LVDS_PMATCR2_PMATDL4_5                                 (0x20UL << LVDS_PMATCR2_PMATDL4_Pos)                              /*!< 0x00000020 */
#define LVDS_PMATCR2_PMATDL4_6                                 (0x40UL << LVDS_PMATCR2_PMATDL4_Pos)                              /*!< 0x00000040 */
#define LVDS_PMATCR2_PMATDL4_7                                 (0x80UL << LVDS_PMATCR2_PMATDL4_Pos)                              /*!< 0x00000080 */
#define LVDS_PMATCR2_PMATB_Pos                                 (8U)
#define LVDS_PMATCR2_PMATB_Msk                                 (0xFFUL << LVDS_PMATCR2_PMATB_Pos)                                /*!< 0x0000FF00 */
#define LVDS_PMATCR2_PMATB                                     LVDS_PMATCR2_PMATB_Msk                                           /*!< Phy Master Analog Test Bias */
#define LVDS_PMATCR2_PMATB_0                                   (0x1UL << LVDS_PMATCR2_PMATB_Pos)                               /*!< 0x00000100 */
#define LVDS_PMATCR2_PMATB_1                                   (0x2UL << LVDS_PMATCR2_PMATB_Pos)                               /*!< 0x00000200 */
#define LVDS_PMATCR2_PMATB_2                                   (0x4UL << LVDS_PMATCR2_PMATB_Pos)                               /*!< 0x00000400 */
#define LVDS_PMATCR2_PMATB_3                                   (0x8UL << LVDS_PMATCR2_PMATB_Pos)                               /*!< 0x00000800 */
#define LVDS_PMATCR2_PMATB_4                                   (0x10UL << LVDS_PMATCR2_PMATB_Pos)                              /*!< 0x00001000 */
#define LVDS_PMATCR2_PMATB_5                                   (0x20UL << LVDS_PMATCR2_PMATB_Pos)                              /*!< 0x00002000 */
#define LVDS_PMATCR2_PMATB_6                                   (0x40UL << LVDS_PMATCR2_PMATB_Pos)                              /*!< 0x00004000 */
#define LVDS_PMATCR2_PMATB_7                                   (0x80UL << LVDS_PMATCR2_PMATB_Pos)                              /*!< 0x00008000 */
#define LVDS_PMATCR2_PMATPC_Pos                                (16U)
#define LVDS_PMATCR2_PMATPC_Msk                                (0x7FUL << LVDS_PMATCR2_PMATPC_Pos)                               /*!< 0x007F0000 */
#define LVDS_PMATCR2_PMATPC                                    LVDS_PMATCR2_PMATPC_Msk                                          /*!< Phy Master Analog Test PLL Control */
#define LVDS_PMATCR2_PMATPC_0                                  (0x1UL << LVDS_PMATCR2_PMATPC_Pos)                            /*!< 0x00010000 */
#define LVDS_PMATCR2_PMATPC_1                                  (0x2UL << LVDS_PMATCR2_PMATPC_Pos)                            /*!< 0x00020000 */
#define LVDS_PMATCR2_PMATPC_2                                  (0x4UL << LVDS_PMATCR2_PMATPC_Pos)                            /*!< 0x00040000 */
#define LVDS_PMATCR2_PMATPC_3                                  (0x8UL << LVDS_PMATCR2_PMATPC_Pos)                            /*!< 0x00080000 */
#define LVDS_PMATCR2_PMATPC_4                                  (0x10UL << LVDS_PMATCR2_PMATPC_Pos)                           /*!< 0x00100000 */
#define LVDS_PMATCR2_PMATPC_5                                  (0x20UL << LVDS_PMATCR2_PMATPC_Pos)                           /*!< 0x00200000 */
#define LVDS_PMATCR2_PMATPC_6                                  (0x40UL << LVDS_PMATCR2_PMATPC_Pos)                           /*!< 0x00400000 */

